TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
    struct {
      __IOM uint32_t ADCEN      : 1;            /*!< [0..0] This bit enables the ADC module. While the ADC is enabled,
                                                     the ADCCFG and SLOT Configuration regsiter settings must
                                                     remain stable and unchanged.                                              */
      __IOM uint32_t TMPSPWR    : 1;            /*!< [1..1] This enables power to the temperature sensor module.
                                                     After setting this bit, the temperature sensor will remain
                                                     powered down while the ADC is power is disconnected (i.e,
                                                     when the ADC PWDSTAT is 2'b10).                                           */
      __IOM uint32_t RPTEN      : 1;            /*!< [2..2] This bit enables Repeating Scan Mode.                              */
      __IOM uint32_t LPMODE     : 2;            /*!< [4..3] Select power mode to enter between active scans.                   */
      __IOM uint32_t OPMODE     : 2;            /*!< [6..5] Select the sample rate mode. It adjusts the current in
                                                     the ADC for higher sample rates. A 12MHz ADC clock can
                                                     result in a sample rate up to 1Msps depending on the trigger
                                                     or repeating mode rate. A 1.5MHz ADC clock can result in
                                                     a sample rate up 125K sps. NOTE: All other values not specified
                                                     below are undefined.                                                      */
      __IOM uint32_t BATTLOAD   : 1;            /*!< [7..7] Control 500 Ohm battery load resistor.                             */
      __IOM uint32_t REFSEL     : 2;            /*!< [9..8] Select the ADC reference voltage.                                  */
      __IM  uint32_t            : 6;
      __IOM uint32_t TRIGSEL    : 4;            /*!< [19..16] Select the ADC trigger source.                                   */
      __IOM uint32_t TRIGPOL    : 1;            /*!< [20..20] This bit selects the ADC trigger polarity for external
                                                     off chip triggers.                                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t CLKSEL     : 3;            /*!< [26..24] Select the source and frequency for the ADC clock.
                                                     All values not enumerated below are undefined.                            */
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< (@ 0x00000004) ADC Power Status                                           */

    struct {
      __IOM uint32_t PWDSTAT    : 2;            /*!< [1..0] Indicates the power-status of the ADC.                             */
    } STAT_b;
  } ;

  union {
    __IOM uint32_t SWT;                         /*!< (@ 0x00000008) Software trigger                                           */

    struct {
      __IOM uint32_t SWT        : 8;            /*!< [7..0] Writing 0x37 to this register generates a software trigger.        */
    } SWT_b;
  } ;

  union {
    __IOM uint32_t SL0CFG;                      /*!< (@ 0x0000000C) Slot 0 Configuration Register                              */

    struct {
      __IOM uint32_t SLEN0      : 1;            /*!< [0..0] This bit enables slot 0 for ADC conversions.                       */
      __IOM uint32_t WCEN0      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     0.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL0     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL0     : 3;            /*!< [18..16] Select the track and hold delay for this slot. NOTE:
                                                     The track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL0     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL0CFG_b;
  } ;

  union {
    __IOM uint32_t SL1CFG;                      /*!< (@ 0x00000010) Slot 1 Configuration Register                              */

    struct {
      __IOM uint32_t SLEN1      : 1;            /*!< [0..0] This bit enables slot 1 for ADC conversions.                       */
      __IOM uint32_t WCEN1      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     1.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL1     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL1     : 3;            /*!< [18..16] Select the track and hold delay for this slot. NOTE:
                                                     The track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5 Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL1     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL1CFG_b;
  } ;

  union {
    __IOM uint32_t SL2CFG;                      /*!< (@ 0x00000014) Slot 2 Configuration Register                              */

