TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
    struct {
      __IOM uint32_t SLEN2      : 1;            /*!< [0..0] This bit enables slot 2 for ADC conversions.                       */
      __IOM uint32_t WCEN2      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     2.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL2     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL2     : 3;            /*!< [18..16] Select the track and hold delay for this slot. NOTE:
                                                     The track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL2     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL2CFG_b;
  } ;

  union {
    __IOM uint32_t SL3CFG;                      /*!< (@ 0x00000018) Slot 3 Configuration Register                              */

    struct {
      __IOM uint32_t SLEN3      : 1;            /*!< [0..0] This bit enables slot 3 for ADC conversions.                       */
      __IOM uint32_t WCEN3      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     3.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL3     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL3     : 3;            /*!< [18..16] Select the track and hold delay for this slot. NOTE:
                                                     The track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL3     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL3CFG_b;
  } ;

  union {
    __IOM uint32_t SL4CFG;                      /*!< (@ 0x0000001C) Slot 4 Configuration Register                              */

    struct {
      __IOM uint32_t SLEN4      : 1;            /*!< [0..0] This bit enables slot 4 for ADC conversions.                       */
      __IOM uint32_t WCEN4      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     4.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL4     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL4     : 3;            /*!< [18..16] Select the track and hold delay for this slot. NOTE:
                                                     The track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL4     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL4CFG_b;
  } ;

  union {
    __IOM uint32_t SL5CFG;                      /*!< (@ 0x00000020) Slot 5 Configuration Register                              */

    struct {
      __IOM uint32_t SLEN5      : 1;            /*!< [0..0] This bit enables slot 5 for ADC conversions.                       */
      __IOM uint32_t WCEN5      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     5.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL5     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL5     : 3;            /*!< [18..16] Select track and hold delay for this slot. NOTE: The
                                                     track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL5     : 3;            /*!< [26..24] Select number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
    } SL5CFG_b;
  } ;

  union {
    __IOM uint32_t SL6CFG;                      /*!< (@ 0x00000024) Slot 6 Configuration Register                              */

