TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
    struct {
      __IOM uint32_t SLEN6      : 1;            /*!< [0..0] This bit enables slot 6 for ADC conversions.                       */
      __IOM uint32_t WCEN6      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     6.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL6     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL6     : 3;            /*!< [18..16] Select track and hold delay for this slot. NOTE: The
                                                     track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL6     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL6CFG_b;
  } ;

  union {
    __IOM uint32_t SL7CFG;                      /*!< (@ 0x00000028) Slot 7 Configuration Register                              */

    struct {
      __IOM uint32_t SLEN7      : 1;            /*!< [0..0] This bit enables slot 7 for ADC conversions.                       */
      __IOM uint32_t WCEN7      : 1;            /*!< [1..1] This bit enables the window compare function for slot
                                                     7.                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t CHSEL7     : 4;            /*!< [11..8] Select one of the 13 channel inputs for this slot.                */
      __IM  uint32_t            : 4;
      __IOM uint32_t THSEL7     : 3;            /*!< [18..16] Select track and hold delay for this slot. NOTE: The
                                                     track and hold delay must be less than 50us for correct
                                                     operation. When the ADC is configured to use the 1.5Mhz
                                                     clock, the track and hold delay cannot exceed 64 clocks.                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t ADSEL7     : 3;            /*!< [26..24] Select the number of measurements to average in the
                                                     accumulate divide module for this slot.                                   */
    } SL7CFG_b;
  } ;

  union {
    __IOM uint32_t WLIM;                        /*!< (@ 0x0000002C) Window Comparator Limits Register                          */

    struct {
      __IOM uint32_t LLIM       : 16;           /*!< [15..0] Sets the lower limit for the wondow comparator.                   */
      __IOM uint32_t ULIM       : 16;           /*!< [31..16] Sets the upper limit for the wondow comparator.                  */
    } WLIM_b;
  } ;

  union {
    __IOM uint32_t FIFO;                        /*!< (@ 0x00000030) FIFO Data and Valid Count Register                         */

    struct {
      __IOM uint32_t DATA       : 16;           /*!< [15..0] Oldest data in the FIFO.                                          */
      __IOM uint32_t COUNT      : 4;            /*!< [19..16] Number of valid entries in the ADC FIFO.                         */
      __IOM uint32_t RSVD_20    : 4;            /*!< [23..20] RESERVED.                                                        */
      __IOM uint32_t SLOTNUM    : 3;            /*!< [26..24] Slot number associated with this FIFO data.                      */
      __IOM uint32_t RSVD_27    : 5;            /*!< [31..27] RESERVED.                                                        */
    } FIFO_b;
  } ;
  __IM  uint32_t  RESERVED[115];

  union {
    __IOM uint32_t INTEN;                       /*!< (@ 0x00000200) ADC Interrupt registers: Enable                            */

    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< [0..0] ADC conversion complete interrupt.                                 */
      __IOM uint32_t SCNCMP     : 1;            /*!< [1..1] ADC scan complete interrupt.                                       */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< [2..2] FIFO 75 percent full interrupt.                                    */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< [3..3] FIFO 100 percent full interrupt.                                   */
      __IOM uint32_t WCEXC      : 1;            /*!< [4..4] Window comparator voltage excursion interrupt.                     */
      __IOM uint32_t WCINC      : 1;            /*!< [5..5] Window comparator voltage incursion interrupt.                     */
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000204) ADC Interrupt registers: Status                            */

    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< [0..0] ADC conversion complete interrupt.                                 */
      __IOM uint32_t SCNCMP     : 1;            /*!< [1..1] ADC scan complete interrupt.                                       */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< [2..2] FIFO 75 percent full interrupt.                                    */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< [3..3] FIFO 100 percent full interrupt.                                   */
      __IOM uint32_t WCEXC      : 1;            /*!< [4..4] Window comparator voltage excursion interrupt.                     */
      __IOM uint32_t WCINC      : 1;            /*!< [5..5] Window comparator voltage incursion interrupt.                     */
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) ADC Interrupt registers: Clear                             */

