TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
    struct {
      __IOM uint32_t CTMRA0INT  : 1;            /*!< [0..0] Counter/Timer A0 interrupt.                                        */
      __IOM uint32_t CTMRB0INT  : 1;            /*!< [1..1] Counter/Timer B0 interrupt.                                        */
      __IOM uint32_t CTMRA1INT  : 1;            /*!< [2..2] Counter/Timer A1 interrupt.                                        */
      __IOM uint32_t CTMRB1INT  : 1;            /*!< [3..3] Counter/Timer B1 interrupt.                                        */
      __IOM uint32_t CTMRA2INT  : 1;            /*!< [4..4] Counter/Timer A2 interrupt.                                        */
      __IOM uint32_t CTMRB2INT  : 1;            /*!< [5..5] Counter/Timer B2 interrupt.                                        */
      __IOM uint32_t CTMRA3INT  : 1;            /*!< [6..6] Counter/Timer A3 interrupt.                                        */
      __IOM uint32_t CTMRB3INT  : 1;            /*!< [7..7] Counter/Timer B3 interrupt.                                        */
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000204) Counter/Timer Interrupts: Status                           */

    struct {
      __IOM uint32_t CTMRA0INT  : 1;            /*!< [0..0] Counter/Timer A0 interrupt.                                        */
      __IOM uint32_t CTMRB0INT  : 1;            /*!< [1..1] Counter/Timer B0 interrupt.                                        */
      __IOM uint32_t CTMRA1INT  : 1;            /*!< [2..2] Counter/Timer A1 interrupt.                                        */
      __IOM uint32_t CTMRB1INT  : 1;            /*!< [3..3] Counter/Timer B1 interrupt.                                        */
      __IOM uint32_t CTMRA2INT  : 1;            /*!< [4..4] Counter/Timer A2 interrupt.                                        */
      __IOM uint32_t CTMRB2INT  : 1;            /*!< [5..5] Counter/Timer B2 interrupt.                                        */
      __IOM uint32_t CTMRA3INT  : 1;            /*!< [6..6] Counter/Timer A3 interrupt.                                        */
      __IOM uint32_t CTMRB3INT  : 1;            /*!< [7..7] Counter/Timer B3 interrupt.                                        */
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) Counter/Timer Interrupts: Clear                            */

    struct {
      __IOM uint32_t CTMRA0INT  : 1;            /*!< [0..0] Counter/Timer A0 interrupt.                                        */
      __IOM uint32_t CTMRB0INT  : 1;            /*!< [1..1] Counter/Timer B0 interrupt.                                        */
      __IOM uint32_t CTMRA1INT  : 1;            /*!< [2..2] Counter/Timer A1 interrupt.                                        */
      __IOM uint32_t CTMRB1INT  : 1;            /*!< [3..3] Counter/Timer B1 interrupt.                                        */
      __IOM uint32_t CTMRA2INT  : 1;            /*!< [4..4] Counter/Timer A2 interrupt.                                        */
      __IOM uint32_t CTMRB2INT  : 1;            /*!< [5..5] Counter/Timer B2 interrupt.                                        */
      __IOM uint32_t CTMRA3INT  : 1;            /*!< [6..6] Counter/Timer A3 interrupt.                                        */
      __IOM uint32_t CTMRB3INT  : 1;            /*!< [7..7] Counter/Timer B3 interrupt.                                        */
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) Counter/Timer Interrupts: Set                              */

    struct {
      __IOM uint32_t CTMRA0INT  : 1;            /*!< [0..0] Counter/Timer A0 interrupt.                                        */
      __IOM uint32_t CTMRB0INT  : 1;            /*!< [1..1] Counter/Timer B0 interrupt.                                        */
      __IOM uint32_t CTMRA1INT  : 1;            /*!< [2..2] Counter/Timer A1 interrupt.                                        */
      __IOM uint32_t CTMRB1INT  : 1;            /*!< [3..3] Counter/Timer B1 interrupt.                                        */
      __IOM uint32_t CTMRA2INT  : 1;            /*!< [4..4] Counter/Timer A2 interrupt.                                        */
      __IOM uint32_t CTMRB2INT  : 1;            /*!< [5..5] Counter/Timer B2 interrupt.                                        */
      __IOM uint32_t CTMRA3INT  : 1;            /*!< [6..6] Counter/Timer A3 interrupt.                                        */
      __IOM uint32_t CTMRB3INT  : 1;            /*!< [7..7] Counter/Timer B3 interrupt.                                        */
    } INTSET_b;
  } ;
} CTIMER_Type;                                  /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose IO (GPIO)
  */

typedef struct {                                /*!< (@ 0x40010000) GPIO Structure                                             */

  union {
    __IOM uint32_t PADREGA;                     /*!< (@ 0x00000000) Pad Configuration Register A                               */

    struct {
      __IOM uint32_t PAD0PULL   : 1;            /*!< [0..0] Pad 0 pullup enable                                                */
      __IOM uint32_t PAD0INPEN  : 1;            /*!< [1..1] Pad 0 input enable                                                 */
      __IOM uint32_t PAD0STRNG  : 1;            /*!< [2..2] Pad 0 drive strength                                               */
      __IOM uint32_t PAD0FNCSEL : 3;            /*!< [5..3] Pad 0 function select                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD1PULL   : 1;            /*!< [8..8] Pad 1 pullup enable                                                */
      __IOM uint32_t PAD1INPEN  : 1;            /*!< [9..9] Pad 1 input enable                                                 */
      __IOM uint32_t PAD1STRNG  : 1;            /*!< [10..10] Pad 1 drive strength                                             */
      __IOM uint32_t PAD1FNCSEL : 3;            /*!< [13..11] Pad 1 function select                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD2PULL   : 1;            /*!< [16..16] Pad 2 pullup enable                                              */
      __IOM uint32_t PAD2INPEN  : 1;            /*!< [17..17] Pad 2 input enable                                               */
      __IOM uint32_t PAD2STRNG  : 1;            /*!< [18..18] Pad 2 drive strength                                             */
      __IOM uint32_t PAD2FNCSEL : 3;            /*!< [21..19] Pad 2 function select                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD3PULL   : 1;            /*!< [24..24] Pad 3 pullup enable                                              */
      __IOM uint32_t PAD3INPEN  : 1;            /*!< [25..25] Pad 3 input enable.                                              */
      __IOM uint32_t PAD3STRNG  : 1;            /*!< [26..26] Pad 3 drive strength.                                            */
      __IOM uint32_t PAD3FNCSEL : 3;            /*!< [29..27] Pad 3 function select                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t PAD3PWRUP  : 1;            /*!< [31..31] Pad 3 upper power switch enable                                  */
    } PADREGA_b;
  } ;

  union {
    __IOM uint32_t PADREGB;                     /*!< (@ 0x00000004) Pad Configuration Register B                               */

