TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< [0..0] This is the Command Complete interrupt.                            */
      __IOM uint32_t THR        : 1;            /*!< [1..1] This is the FIFO Threshold interrupt.                              */
      __IOM uint32_t FUNDFL     : 1;            /*!< [2..2] This is the Write FIFO Underflow interrupt.                        */
      __IOM uint32_t FOVFL      : 1;            /*!< [3..3] This is the Read FIFO Overflow interrupt.                          */
      __IOM uint32_t NAK        : 1;            /*!< [4..4] This is the I2C NAK interrupt.                                     */
      __IOM uint32_t WTLEN      : 1;            /*!< [5..5] This is the write length mismatch interrupt.                       */
      __IOM uint32_t IACC       : 1;            /*!< [6..6] This is the illegal FIFO access interrupt.                         */
      __IOM uint32_t ICMD       : 1;            /*!< [7..7] This is the illegal command interrupt.                             */
      __IOM uint32_t START      : 1;            /*!< [8..8] This is the START command interrupt.                               */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] This is the STOP command interrupt.                                */
      __IOM uint32_t ARB        : 1;            /*!< [10..10] This is the arbitration loss interrupt.                          */
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) IO Master Interrupts: Clear                                */

    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< [0..0] This is the Command Complete interrupt.                            */
      __IOM uint32_t THR        : 1;            /*!< [1..1] This is the FIFO Threshold interrupt.                              */
      __IOM uint32_t FUNDFL     : 1;            /*!< [2..2] This is the Write FIFO Underflow interrupt.                        */
      __IOM uint32_t FOVFL      : 1;            /*!< [3..3] This is the Read FIFO Overflow interrupt.                          */
      __IOM uint32_t NAK        : 1;            /*!< [4..4] This is the I2C NAK interrupt.                                     */
      __IOM uint32_t WTLEN      : 1;            /*!< [5..5] This is the write length mismatch interrupt.                       */
      __IOM uint32_t IACC       : 1;            /*!< [6..6] This is the illegal FIFO access interrupt.                         */
      __IOM uint32_t ICMD       : 1;            /*!< [7..7] This is the illegal command interrupt.                             */
      __IOM uint32_t START      : 1;            /*!< [8..8] This is the START command interrupt.                               */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] This is the STOP command interrupt.                                */
      __IOM uint32_t ARB        : 1;            /*!< [10..10] This is the arbitration loss interrupt.                          */
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) IO Master Interrupts: Set                                  */

    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< [0..0] This is the Command Complete interrupt.                            */
      __IOM uint32_t THR        : 1;            /*!< [1..1] This is the FIFO Threshold interrupt.                              */
      __IOM uint32_t FUNDFL     : 1;            /*!< [2..2] This is the Write FIFO Underflow interrupt.                        */
      __IOM uint32_t FOVFL      : 1;            /*!< [3..3] This is the Read FIFO Overflow interrupt.                          */
      __IOM uint32_t NAK        : 1;            /*!< [4..4] This is the I2C NAK interrupt.                                     */
      __IOM uint32_t WTLEN      : 1;            /*!< [5..5] This is the write length mismatch interrupt.                       */
      __IOM uint32_t IACC       : 1;            /*!< [6..6] This is the illegal FIFO access interrupt.                         */
      __IOM uint32_t ICMD       : 1;            /*!< [7..7] This is the illegal command interrupt.                             */
      __IOM uint32_t START      : 1;            /*!< [8..8] This is the START command interrupt.                               */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] This is the STOP command interrupt.                                */
      __IOM uint32_t ARB        : 1;            /*!< [10..10] This is the arbitration loss interrupt.                          */
    } INTSET_b;
  } ;
} IOMSTR0_Type;                                 /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C/SPI Slave (IOSLAVE)
  */

typedef struct {                                /*!< (@ 0x50000000) IOSLAVE Structure                                          */
  __IM  uint32_t  RESERVED[64];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< (@ 0x00000100) Current FIFO Pointer                                       */

    struct {
      __IOM uint32_t FIFOPTR    : 8;            /*!< [7..0] Current FIFO pointer.                                              */
      __IOM uint32_t FIFOSIZ    : 8;            /*!< [15..8] The number of bytes currently in the hardware FIFO.               */
    } FIFOPTR_b;
  } ;

  union {
    __IOM uint32_t FIFOCFG;                     /*!< (@ 0x00000104) FIFO Configuration                                         */

    struct {
      __IOM uint32_t FIFOBASE   : 5;            /*!< [4..0] These bits hold the base address of the I/O FIFO in 8
                                                     byte segments. The IO Slave FIFO is situated in LRAM at
                                                     (FIFOBASE*8) to (FIFOMAX*8-1).                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t FIFOMAX    : 6;            /*!< [13..8] These bits hold the maximum FIFO address in 8 byte segments.
                                                     It is also the beginning of the RAM area of the LRAM. Note
                                                     that no RAM area is configured if FIFOMAX is set to 0x1F.                 */
      __IM  uint32_t            : 10;
      __IOM uint32_t ROBASE     : 6;            /*!< [29..24] Defines the read-only area. The IO Slave read-only
                                                     area is situated in LRAM at (ROBASE*8) to (FIFOOBASE*8-1)                 */
    } FIFOCFG_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< (@ 0x00000108) FIFO Threshold Configuration                               */

