TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
    struct {
      __IOM uint32_t MEMBUCKEN  : 1;            /*!< [0..0] Enables and select the Memory Buck as the supply for
                                                     the Flash and SRAM power domain.                                          */
      __IOM uint32_t COREBUCKEN : 1;            /*!< [1..1] Enables and Selects the Core Buck as the supply for the
                                                     low-voltage power domain.                                                 */
    } SUPPLYSRC_b;
  } ;

  union {
    __IOM uint32_t SUPPLYSTATUS;                /*!< (@ 0x00000014) Memory and Core Voltage Supply Source Status
                                                                    Register                                                   */

    struct {
      __IOM uint32_t MEMBUCKON  : 1;            /*!< [0..0] Indicate whether the Memory power domain is supplied
                                                     from the LDO or the Buck.                                                 */
      __IOM uint32_t COREBUCKON : 1;            /*!< [1..1] Indicates whether the Core low-voltage domain is supplied
                                                     from the LDO or the Buck.                                                 */
    } SUPPLYSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED[57];

  union {
    __IOM uint32_t BANDGAPEN;                   /*!< (@ 0x000000FC) Band Gap Enable                                            */

    struct {
      __IOM uint32_t BGPEN      : 1;            /*!< [0..0] Bandgap Enable                                                     */
    } BANDGAPEN_b;
  } ;
  __IM  uint32_t  RESERVED1[16];

  union {
    __IOM uint32_t SRAMPWDINSLEEP;              /*!< (@ 0x00000140) Powerdown an SRAM Bank in Deep Sleep mode                  */

    struct {
      __IOM uint32_t BANK0      : 1;            /*!< [0..0] Force SRAM Bank 0 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK1      : 1;            /*!< [1..1] Force SRAM Bank 1 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK2      : 1;            /*!< [2..2] Force SRAM Bank 2 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK3      : 1;            /*!< [3..3] Force SRAM Bank 3 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK4      : 1;            /*!< [4..4] Force SRAM Bank 4 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK5      : 1;            /*!< [5..5] Force SRAM Bank 5 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK6      : 1;            /*!< [6..6] Force SRAM Bank 6 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
      __IOM uint32_t BANK7      : 1;            /*!< [7..7] Force SRAM Bank 7 to powerdown in deep sleep mode, causing
                                                     the contents of the bank to be lost.                                      */
    } SRAMPWDINSLEEP_b;
  } ;

  union {
    __IOM uint32_t SRAMPWRDIS;                  /*!< (@ 0x00000144) Disables individual banks of the SRAM array                */

    struct {
      __IOM uint32_t BANK0      : 1;            /*!< [0..0] Remove power from SRAM Bank 0 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK1      : 1;            /*!< [1..1] Remove power from SRAM Bank 1 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK2      : 1;            /*!< [2..2] Remove power from SRAM Bank 2 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK3      : 1;            /*!< [3..3] Remove power from SRAM Bank 3 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK4      : 1;            /*!< [4..4] Remove power from SRAM Bank 4 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK5      : 1;            /*!< [5..5] Remove power from SRAM Bank 5 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK6      : 1;            /*!< [6..6] Remove power from SRAM Bank 6 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
      __IOM uint32_t BANK7      : 1;            /*!< [7..7] Remove power from SRAM Bank 7 which will cause an access
                                                     to its address space to generate a Hard Fault.                            */
    } SRAMPWRDIS_b;
  } ;

  union {
    __IOM uint32_t FLASHPWRDIS;                 /*!< (@ 0x00000148) Disables individual banks of the Flash array               */

