TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
#define CTIMER_CTRL3_TMRA3EN_Pos          (0UL)                     /*!< TMRA3EN (Bit 0)                                       */
#define CTIMER_CTRL3_TMRA3EN_Msk          (0x1UL)                   /*!< TMRA3EN (Bitfield-Mask: 0x01)                         */
/* =========================================================  INTEN  ========================================================= */
#define CTIMER_INTEN_CTMRB3INT_Pos        (7UL)                     /*!< CTMRB3INT (Bit 7)                                     */
#define CTIMER_INTEN_CTMRB3INT_Msk        (0x80UL)                  /*!< CTMRB3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRA3INT_Pos        (6UL)                     /*!< CTMRA3INT (Bit 6)                                     */
#define CTIMER_INTEN_CTMRA3INT_Msk        (0x40UL)                  /*!< CTMRA3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRB2INT_Pos        (5UL)                     /*!< CTMRB2INT (Bit 5)                                     */
#define CTIMER_INTEN_CTMRB2INT_Msk        (0x20UL)                  /*!< CTMRB2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRA2INT_Pos        (4UL)                     /*!< CTMRA2INT (Bit 4)                                     */
#define CTIMER_INTEN_CTMRA2INT_Msk        (0x10UL)                  /*!< CTMRA2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRB1INT_Pos        (3UL)                     /*!< CTMRB1INT (Bit 3)                                     */
#define CTIMER_INTEN_CTMRB1INT_Msk        (0x8UL)                   /*!< CTMRB1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRA1INT_Pos        (2UL)                     /*!< CTMRA1INT (Bit 2)                                     */
#define CTIMER_INTEN_CTMRA1INT_Msk        (0x4UL)                   /*!< CTMRA1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRB0INT_Pos        (1UL)                     /*!< CTMRB0INT (Bit 1)                                     */
#define CTIMER_INTEN_CTMRB0INT_Msk        (0x2UL)                   /*!< CTMRB0INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTEN_CTMRA0INT_Pos        (0UL)                     /*!< CTMRA0INT (Bit 0)                                     */
#define CTIMER_INTEN_CTMRA0INT_Msk        (0x1UL)                   /*!< CTMRA0INT (Bitfield-Mask: 0x01)                       */
/* ========================================================  INTSTAT  ======================================================== */
#define CTIMER_INTSTAT_CTMRB3INT_Pos      (7UL)                     /*!< CTMRB3INT (Bit 7)                                     */
#define CTIMER_INTSTAT_CTMRB3INT_Msk      (0x80UL)                  /*!< CTMRB3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRA3INT_Pos      (6UL)                     /*!< CTMRA3INT (Bit 6)                                     */
#define CTIMER_INTSTAT_CTMRA3INT_Msk      (0x40UL)                  /*!< CTMRA3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRB2INT_Pos      (5UL)                     /*!< CTMRB2INT (Bit 5)                                     */
#define CTIMER_INTSTAT_CTMRB2INT_Msk      (0x20UL)                  /*!< CTMRB2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRA2INT_Pos      (4UL)                     /*!< CTMRA2INT (Bit 4)                                     */
#define CTIMER_INTSTAT_CTMRA2INT_Msk      (0x10UL)                  /*!< CTMRA2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRB1INT_Pos      (3UL)                     /*!< CTMRB1INT (Bit 3)                                     */
#define CTIMER_INTSTAT_CTMRB1INT_Msk      (0x8UL)                   /*!< CTMRB1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRA1INT_Pos      (2UL)                     /*!< CTMRA1INT (Bit 2)                                     */
#define CTIMER_INTSTAT_CTMRA1INT_Msk      (0x4UL)                   /*!< CTMRA1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRB0INT_Pos      (1UL)                     /*!< CTMRB0INT (Bit 1)                                     */
#define CTIMER_INTSTAT_CTMRB0INT_Msk      (0x2UL)                   /*!< CTMRB0INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSTAT_CTMRA0INT_Pos      (0UL)                     /*!< CTMRA0INT (Bit 0)                                     */
#define CTIMER_INTSTAT_CTMRA0INT_Msk      (0x1UL)                   /*!< CTMRA0INT (Bitfield-Mask: 0x01)                       */
/* ========================================================  INTCLR  ========================================================= */
#define CTIMER_INTCLR_CTMRB3INT_Pos       (7UL)                     /*!< CTMRB3INT (Bit 7)                                     */
#define CTIMER_INTCLR_CTMRB3INT_Msk       (0x80UL)                  /*!< CTMRB3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRA3INT_Pos       (6UL)                     /*!< CTMRA3INT (Bit 6)                                     */
#define CTIMER_INTCLR_CTMRA3INT_Msk       (0x40UL)                  /*!< CTMRA3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRB2INT_Pos       (5UL)                     /*!< CTMRB2INT (Bit 5)                                     */
#define CTIMER_INTCLR_CTMRB2INT_Msk       (0x20UL)                  /*!< CTMRB2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRA2INT_Pos       (4UL)                     /*!< CTMRA2INT (Bit 4)                                     */
#define CTIMER_INTCLR_CTMRA2INT_Msk       (0x10UL)                  /*!< CTMRA2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRB1INT_Pos       (3UL)                     /*!< CTMRB1INT (Bit 3)                                     */
#define CTIMER_INTCLR_CTMRB1INT_Msk       (0x8UL)                   /*!< CTMRB1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRA1INT_Pos       (2UL)                     /*!< CTMRA1INT (Bit 2)                                     */
#define CTIMER_INTCLR_CTMRA1INT_Msk       (0x4UL)                   /*!< CTMRA1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRB0INT_Pos       (1UL)                     /*!< CTMRB0INT (Bit 1)                                     */
#define CTIMER_INTCLR_CTMRB0INT_Msk       (0x2UL)                   /*!< CTMRB0INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTCLR_CTMRA0INT_Pos       (0UL)                     /*!< CTMRA0INT (Bit 0)                                     */
#define CTIMER_INTCLR_CTMRA0INT_Msk       (0x1UL)                   /*!< CTMRA0INT (Bitfield-Mask: 0x01)                       */
/* ========================================================  INTSET  ========================================================= */
#define CTIMER_INTSET_CTMRB3INT_Pos       (7UL)                     /*!< CTMRB3INT (Bit 7)                                     */
#define CTIMER_INTSET_CTMRB3INT_Msk       (0x80UL)                  /*!< CTMRB3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRA3INT_Pos       (6UL)                     /*!< CTMRA3INT (Bit 6)                                     */
#define CTIMER_INTSET_CTMRA3INT_Msk       (0x40UL)                  /*!< CTMRA3INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRB2INT_Pos       (5UL)                     /*!< CTMRB2INT (Bit 5)                                     */
#define CTIMER_INTSET_CTMRB2INT_Msk       (0x20UL)                  /*!< CTMRB2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRA2INT_Pos       (4UL)                     /*!< CTMRA2INT (Bit 4)                                     */
#define CTIMER_INTSET_CTMRA2INT_Msk       (0x10UL)                  /*!< CTMRA2INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRB1INT_Pos       (3UL)                     /*!< CTMRB1INT (Bit 3)                                     */
#define CTIMER_INTSET_CTMRB1INT_Msk       (0x8UL)                   /*!< CTMRB1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRA1INT_Pos       (2UL)                     /*!< CTMRA1INT (Bit 2)                                     */
#define CTIMER_INTSET_CTMRA1INT_Msk       (0x4UL)                   /*!< CTMRA1INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRB0INT_Pos       (1UL)                     /*!< CTMRB0INT (Bit 1)                                     */
#define CTIMER_INTSET_CTMRB0INT_Msk       (0x2UL)                   /*!< CTMRB0INT (Bitfield-Mask: 0x01)                       */
#define CTIMER_INTSET_CTMRA0INT_Pos       (0UL)                     /*!< CTMRA0INT (Bit 0)                                     */
#define CTIMER_INTSET_CTMRA0INT_Msk       (0x1UL)                   /*!< CTMRA0INT (Bitfield-Mask: 0x01)                       */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

