TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* =========================================================  FIFO  ========================================================== */
#define IOMSTR0_FIFO_FIFO_Pos             (0UL)                     /*!< FIFO (Bit 0)                                          */
#define IOMSTR0_FIFO_FIFO_Msk             (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  FIFOPTR  ======================================================== */
#define IOMSTR0_FIFOPTR_FIFOREM_Pos       (16UL)                    /*!< FIFOREM (Bit 16)                                      */
#define IOMSTR0_FIFOPTR_FIFOREM_Msk       (0x7f0000UL)              /*!< FIFOREM (Bitfield-Mask: 0x7f)                         */
#define IOMSTR0_FIFOPTR_FIFOSIZ_Pos       (0UL)                     /*!< FIFOSIZ (Bit 0)                                       */
#define IOMSTR0_FIFOPTR_FIFOSIZ_Msk       (0x7fUL)                  /*!< FIFOSIZ (Bitfield-Mask: 0x7f)                         */
/* ========================================================  TLNGTH  ========================================================= */
#define IOMSTR0_TLNGTH_TLNGTH_Pos         (0UL)                     /*!< TLNGTH (Bit 0)                                        */
#define IOMSTR0_TLNGTH_TLNGTH_Msk         (0xfffUL)                 /*!< TLNGTH (Bitfield-Mask: 0xfff)                         */
/* ========================================================  FIFOTHR  ======================================================== */
#define IOMSTR0_FIFOTHR_FIFOWTHR_Pos      (8UL)                     /*!< FIFOWTHR (Bit 8)                                      */
#define IOMSTR0_FIFOTHR_FIFOWTHR_Msk      (0x3f00UL)                /*!< FIFOWTHR (Bitfield-Mask: 0x3f)                        */
#define IOMSTR0_FIFOTHR_FIFORTHR_Pos      (0UL)                     /*!< FIFORTHR (Bit 0)                                      */
#define IOMSTR0_FIFOTHR_FIFORTHR_Msk      (0x3fUL)                  /*!< FIFORTHR (Bitfield-Mask: 0x3f)                        */
/* ========================================================  CLKCFG  ========================================================= */
#define IOMSTR0_CLKCFG_TOTPER_Pos         (24UL)                    /*!< TOTPER (Bit 24)                                       */
#define IOMSTR0_CLKCFG_TOTPER_Msk         (0xff000000UL)            /*!< TOTPER (Bitfield-Mask: 0xff)                          */
#define IOMSTR0_CLKCFG_LOWPER_Pos         (16UL)                    /*!< LOWPER (Bit 16)                                       */
#define IOMSTR0_CLKCFG_LOWPER_Msk         (0xff0000UL)              /*!< LOWPER (Bitfield-Mask: 0xff)                          */
#define IOMSTR0_CLKCFG_DIVEN_Pos          (12UL)                    /*!< DIVEN (Bit 12)                                        */
#define IOMSTR0_CLKCFG_DIVEN_Msk          (0x1000UL)                /*!< DIVEN (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_CLKCFG_DIV3_Pos           (11UL)                    /*!< DIV3 (Bit 11)                                         */
#define IOMSTR0_CLKCFG_DIV3_Msk           (0x800UL)                 /*!< DIV3 (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_CLKCFG_FSEL_Pos           (8UL)                     /*!< FSEL (Bit 8)                                          */
#define IOMSTR0_CLKCFG_FSEL_Msk           (0x700UL)                 /*!< FSEL (Bitfield-Mask: 0x07)                            */
/* ==========================================================  CMD  ========================================================== */
#define IOMSTR0_CMD_CMD_Pos               (0UL)                     /*!< CMD (Bit 0)                                           */
#define IOMSTR0_CMD_CMD_Msk               (0xffffffffUL)            /*!< CMD (Bitfield-Mask: 0xffffffff)                       */
/* ========================================================  CMDRPT  ========================================================= */
#define IOMSTR0_CMDRPT_CMDRPT_Pos         (0UL)                     /*!< CMDRPT (Bit 0)                                        */
#define IOMSTR0_CMDRPT_CMDRPT_Msk         (0x1fUL)                  /*!< CMDRPT (Bitfield-Mask: 0x1f)                          */
/* ========================================================  STATUS  ========================================================= */
#define IOMSTR0_STATUS_IDLEST_Pos         (2UL)                     /*!< IDLEST (Bit 2)                                        */
#define IOMSTR0_STATUS_IDLEST_Msk         (0x4UL)                   /*!< IDLEST (Bitfield-Mask: 0x01)                          */
#define IOMSTR0_STATUS_CMDACT_Pos         (1UL)                     /*!< CMDACT (Bit 1)                                        */
#define IOMSTR0_STATUS_CMDACT_Msk         (0x2UL)                   /*!< CMDACT (Bitfield-Mask: 0x01)                          */
#define IOMSTR0_STATUS_ERR_Pos            (0UL)                     /*!< ERR (Bit 0)                                           */
#define IOMSTR0_STATUS_ERR_Msk            (0x1UL)                   /*!< ERR (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CFG  ========================================================== */
#define IOMSTR0_CFG_IFCEN_Pos             (31UL)                    /*!< IFCEN (Bit 31)                                        */
#define IOMSTR0_CFG_IFCEN_Msk             (0x80000000UL)            /*!< IFCEN (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_CFG_SPHA_Pos              (2UL)                     /*!< SPHA (Bit 2)                                          */
#define IOMSTR0_CFG_SPHA_Msk              (0x4UL)                   /*!< SPHA (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_CFG_SPOL_Pos              (1UL)                     /*!< SPOL (Bit 1)                                          */
#define IOMSTR0_CFG_SPOL_Msk              (0x2UL)                   /*!< SPOL (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_CFG_IFCSEL_Pos            (0UL)                     /*!< IFCSEL (Bit 0)                                        */
#define IOMSTR0_CFG_IFCSEL_Msk            (0x1UL)                   /*!< IFCSEL (Bitfield-Mask: 0x01)                          */
/* =========================================================  INTEN  ========================================================= */
#define IOMSTR0_INTEN_ARB_Pos             (10UL)                    /*!< ARB (Bit 10)                                          */
#define IOMSTR0_INTEN_ARB_Msk             (0x400UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTEN_STOP_Pos            (9UL)                     /*!< STOP (Bit 9)                                          */
#define IOMSTR0_INTEN_STOP_Msk            (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTEN_START_Pos           (8UL)                     /*!< START (Bit 8)                                         */
#define IOMSTR0_INTEN_START_Msk           (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTEN_ICMD_Pos            (7UL)                     /*!< ICMD (Bit 7)                                          */
#define IOMSTR0_INTEN_ICMD_Msk            (0x80UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTEN_IACC_Pos            (6UL)                     /*!< IACC (Bit 6)                                          */
#define IOMSTR0_INTEN_IACC_Msk            (0x40UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTEN_WTLEN_Pos           (5UL)                     /*!< WTLEN (Bit 5)                                         */
#define IOMSTR0_INTEN_WTLEN_Msk           (0x20UL)                  /*!< WTLEN (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTEN_NAK_Pos             (4UL)                     /*!< NAK (Bit 4)                                           */
#define IOMSTR0_INTEN_NAK_Msk             (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTEN_FOVFL_Pos           (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define IOMSTR0_INTEN_FOVFL_Msk           (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTEN_FUNDFL_Pos          (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOMSTR0_INTEN_FUNDFL_Msk          (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOMSTR0_INTEN_THR_Pos             (1UL)                     /*!< THR (Bit 1)                                           */
#define IOMSTR0_INTEN_THR_Msk             (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTEN_CMDCMP_Pos          (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define IOMSTR0_INTEN_CMDCMP_Msk          (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define IOMSTR0_INTSTAT_ARB_Pos           (10UL)                    /*!< ARB (Bit 10)                                          */
#define IOMSTR0_INTSTAT_ARB_Msk           (0x400UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTSTAT_STOP_Pos          (9UL)                     /*!< STOP (Bit 9)                                          */
#define IOMSTR0_INTSTAT_STOP_Msk          (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTSTAT_START_Pos         (8UL)                     /*!< START (Bit 8)                                         */
#define IOMSTR0_INTSTAT_START_Msk         (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTSTAT_ICMD_Pos          (7UL)                     /*!< ICMD (Bit 7)                                          */
#define IOMSTR0_INTSTAT_ICMD_Msk          (0x80UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTSTAT_IACC_Pos          (6UL)                     /*!< IACC (Bit 6)                                          */
#define IOMSTR0_INTSTAT_IACC_Msk          (0x40UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTSTAT_WTLEN_Pos         (5UL)                     /*!< WTLEN (Bit 5)                                         */
#define IOMSTR0_INTSTAT_WTLEN_Msk         (0x20UL)                  /*!< WTLEN (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTSTAT_NAK_Pos           (4UL)                     /*!< NAK (Bit 4)                                           */
#define IOMSTR0_INTSTAT_NAK_Msk           (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTSTAT_FOVFL_Pos         (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define IOMSTR0_INTSTAT_FOVFL_Msk         (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTSTAT_FUNDFL_Pos        (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOMSTR0_INTSTAT_FUNDFL_Msk        (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOMSTR0_INTSTAT_THR_Pos           (1UL)                     /*!< THR (Bit 1)                                           */
#define IOMSTR0_INTSTAT_THR_Msk           (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTSTAT_CMDCMP_Pos        (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define IOMSTR0_INTSTAT_CMDCMP_Msk        (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define IOMSTR0_INTCLR_ARB_Pos            (10UL)                    /*!< ARB (Bit 10)                                          */
#define IOMSTR0_INTCLR_ARB_Msk            (0x400UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTCLR_STOP_Pos           (9UL)                     /*!< STOP (Bit 9)                                          */
#define IOMSTR0_INTCLR_STOP_Msk           (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTCLR_START_Pos          (8UL)                     /*!< START (Bit 8)                                         */
#define IOMSTR0_INTCLR_START_Msk          (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTCLR_ICMD_Pos           (7UL)                     /*!< ICMD (Bit 7)                                          */
#define IOMSTR0_INTCLR_ICMD_Msk           (0x80UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTCLR_IACC_Pos           (6UL)                     /*!< IACC (Bit 6)                                          */
#define IOMSTR0_INTCLR_IACC_Msk           (0x40UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTCLR_WTLEN_Pos          (5UL)                     /*!< WTLEN (Bit 5)                                         */
#define IOMSTR0_INTCLR_WTLEN_Msk          (0x20UL)                  /*!< WTLEN (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTCLR_NAK_Pos            (4UL)                     /*!< NAK (Bit 4)                                           */
#define IOMSTR0_INTCLR_NAK_Msk            (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTCLR_FOVFL_Pos          (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define IOMSTR0_INTCLR_FOVFL_Msk          (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTCLR_FUNDFL_Pos         (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOMSTR0_INTCLR_FUNDFL_Msk         (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOMSTR0_INTCLR_THR_Pos            (1UL)                     /*!< THR (Bit 1)                                           */
#define IOMSTR0_INTCLR_THR_Msk            (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTCLR_CMDCMP_Pos         (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define IOMSTR0_INTCLR_CMDCMP_Msk         (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define IOMSTR0_INTSET_ARB_Pos            (10UL)                    /*!< ARB (Bit 10)                                          */
#define IOMSTR0_INTSET_ARB_Msk            (0x400UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTSET_STOP_Pos           (9UL)                     /*!< STOP (Bit 9)                                          */
#define IOMSTR0_INTSET_STOP_Msk           (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTSET_START_Pos          (8UL)                     /*!< START (Bit 8)                                         */
#define IOMSTR0_INTSET_START_Msk          (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTSET_ICMD_Pos           (7UL)                     /*!< ICMD (Bit 7)                                          */
#define IOMSTR0_INTSET_ICMD_Msk           (0x80UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTSET_IACC_Pos           (6UL)                     /*!< IACC (Bit 6)                                          */
#define IOMSTR0_INTSET_IACC_Msk           (0x40UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define IOMSTR0_INTSET_WTLEN_Pos          (5UL)                     /*!< WTLEN (Bit 5)                                         */
#define IOMSTR0_INTSET_WTLEN_Msk          (0x20UL)                  /*!< WTLEN (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTSET_NAK_Pos            (4UL)                     /*!< NAK (Bit 4)                                           */
#define IOMSTR0_INTSET_NAK_Msk            (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTSET_FOVFL_Pos          (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define IOMSTR0_INTSET_FOVFL_Msk          (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOMSTR0_INTSET_FUNDFL_Pos         (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOMSTR0_INTSET_FUNDFL_Msk         (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOMSTR0_INTSET_THR_Pos            (1UL)                     /*!< THR (Bit 1)                                           */
#define IOMSTR0_INTSET_THR_Msk            (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define IOMSTR0_INTSET_CMDCMP_Pos         (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define IOMSTR0_INTSET_CMDCMP_Msk         (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */

