TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* =======================================================  CHIP_INFO  ======================================================= */
#define MCUCTRL_CHIP_INFO_CLASS_Pos       (24UL)                    /*!< CLASS (Bit 24)                                        */
#define MCUCTRL_CHIP_INFO_CLASS_Msk       (0xff000000UL)            /*!< CLASS (Bitfield-Mask: 0xff)                           */
#define MCUCTRL_CHIP_INFO_FLASH_Pos       (20UL)                    /*!< FLASH (Bit 20)                                        */
#define MCUCTRL_CHIP_INFO_FLASH_Msk       (0xf00000UL)              /*!< FLASH (Bitfield-Mask: 0x0f)                           */
#define MCUCTRL_CHIP_INFO_RAM_Pos         (16UL)                    /*!< RAM (Bit 16)                                          */
#define MCUCTRL_CHIP_INFO_RAM_Msk         (0xf0000UL)               /*!< RAM (Bitfield-Mask: 0x0f)                             */
#define MCUCTRL_CHIP_INFO_MAJORREV_Pos    (12UL)                    /*!< MAJORREV (Bit 12)                                     */
#define MCUCTRL_CHIP_INFO_MAJORREV_Msk    (0xf000UL)                /*!< MAJORREV (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_CHIP_INFO_MINORREV_Pos    (8UL)                     /*!< MINORREV (Bit 8)                                      */
#define MCUCTRL_CHIP_INFO_MINORREV_Msk    (0xf00UL)                 /*!< MINORREV (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_CHIP_INFO_PKG_Pos         (6UL)                     /*!< PKG (Bit 6)                                           */
#define MCUCTRL_CHIP_INFO_PKG_Msk         (0xc0UL)                  /*!< PKG (Bitfield-Mask: 0x03)                             */
#define MCUCTRL_CHIP_INFO_PINS_Pos        (3UL)                     /*!< PINS (Bit 3)                                          */
#define MCUCTRL_CHIP_INFO_PINS_Msk        (0x38UL)                  /*!< PINS (Bitfield-Mask: 0x07)                            */
#define MCUCTRL_CHIP_INFO_TEMP_Pos        (1UL)                     /*!< TEMP (Bit 1)                                          */
#define MCUCTRL_CHIP_INFO_TEMP_Msk        (0x6UL)                   /*!< TEMP (Bitfield-Mask: 0x03)                            */
#define MCUCTRL_CHIP_INFO_QUAL_Pos        (0UL)                     /*!< QUAL (Bit 0)                                          */
#define MCUCTRL_CHIP_INFO_QUAL_Msk        (0x1UL)                   /*!< QUAL (Bitfield-Mask: 0x01)                            */
/* ========================================================  CHIPID0  ======================================================== */
#define MCUCTRL_CHIPID0_VALUE_Pos         (0UL)                     /*!< VALUE (Bit 0)                                         */
#define MCUCTRL_CHIPID0_VALUE_Msk         (0xffffffffUL)            /*!< VALUE (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CHIPID1  ======================================================== */
#define MCUCTRL_CHIPID1_VALUE_Pos         (0UL)                     /*!< VALUE (Bit 0)                                         */
#define MCUCTRL_CHIPID1_VALUE_Msk         (0xffffffffUL)            /*!< VALUE (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CHIPREV  ======================================================== */
#define MCUCTRL_CHIPREV_REVISION_Pos      (0UL)                     /*!< REVISION (Bit 0)                                      */
#define MCUCTRL_CHIPREV_REVISION_Msk      (0xffUL)                  /*!< REVISION (Bitfield-Mask: 0xff)                        */
/* =======================================================  SUPPLYSRC  ======================================================= */
#define MCUCTRL_SUPPLYSRC_COREBUCKEN_Pos  (1UL)                     /*!< COREBUCKEN (Bit 1)                                    */
#define MCUCTRL_SUPPLYSRC_COREBUCKEN_Msk  (0x2UL)                   /*!< COREBUCKEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SUPPLYSRC_MEMBUCKEN_Pos   (0UL)                     /*!< MEMBUCKEN (Bit 0)                                     */
#define MCUCTRL_SUPPLYSRC_MEMBUCKEN_Msk   (0x1UL)                   /*!< MEMBUCKEN (Bitfield-Mask: 0x01)                       */
/* =====================================================  SUPPLYSTATUS  ====================================================== */
#define MCUCTRL_SUPPLYSTATUS_COREBUCKON_Pos (1UL)                   /*!< COREBUCKON (Bit 1)                                    */
#define MCUCTRL_SUPPLYSTATUS_COREBUCKON_Msk (0x2UL)                 /*!< COREBUCKON (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SUPPLYSTATUS_MEMBUCKON_Pos (0UL)                    /*!< MEMBUCKON (Bit 0)                                     */
#define MCUCTRL_SUPPLYSTATUS_MEMBUCKON_Msk (0x1UL)                  /*!< MEMBUCKON (Bitfield-Mask: 0x01)                       */
/* =======================================================  BANDGAPEN  ======================================================= */
#define MCUCTRL_BANDGAPEN_BGPEN_Pos       (0UL)                     /*!< BGPEN (Bit 0)                                         */
#define MCUCTRL_BANDGAPEN_BGPEN_Msk       (0x1UL)                   /*!< BGPEN (Bitfield-Mask: 0x01)                           */
/* ====================================================  SRAMPWDINSLEEP  ===================================================== */
#define MCUCTRL_SRAMPWDINSLEEP_BANK7_Pos  (7UL)                     /*!< BANK7 (Bit 7)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK7_Msk  (0x80UL)                  /*!< BANK7 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK6_Pos  (6UL)                     /*!< BANK6 (Bit 6)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK6_Msk  (0x40UL)                  /*!< BANK6 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK5_Pos  (5UL)                     /*!< BANK5 (Bit 5)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK5_Msk  (0x20UL)                  /*!< BANK5 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK4_Pos  (4UL)                     /*!< BANK4 (Bit 4)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK4_Msk  (0x10UL)                  /*!< BANK4 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK3_Pos  (3UL)                     /*!< BANK3 (Bit 3)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK3_Msk  (0x8UL)                   /*!< BANK3 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK2_Pos  (2UL)                     /*!< BANK2 (Bit 2)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK2_Msk  (0x4UL)                   /*!< BANK2 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK1_Pos  (1UL)                     /*!< BANK1 (Bit 1)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK1_Msk  (0x2UL)                   /*!< BANK1 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWDINSLEEP_BANK0_Pos  (0UL)                     /*!< BANK0 (Bit 0)                                         */
#define MCUCTRL_SRAMPWDINSLEEP_BANK0_Msk  (0x1UL)                   /*!< BANK0 (Bitfield-Mask: 0x01)                           */
/* ======================================================  SRAMPWRDIS  ======================================================= */
#define MCUCTRL_SRAMPWRDIS_BANK7_Pos      (7UL)                     /*!< BANK7 (Bit 7)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK7_Msk      (0x80UL)                  /*!< BANK7 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK6_Pos      (6UL)                     /*!< BANK6 (Bit 6)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK6_Msk      (0x40UL)                  /*!< BANK6 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK5_Pos      (5UL)                     /*!< BANK5 (Bit 5)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK5_Msk      (0x20UL)                  /*!< BANK5 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK4_Pos      (4UL)                     /*!< BANK4 (Bit 4)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK4_Msk      (0x10UL)                  /*!< BANK4 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK3_Pos      (3UL)                     /*!< BANK3 (Bit 3)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK3_Msk      (0x8UL)                   /*!< BANK3 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK2_Pos      (2UL)                     /*!< BANK2 (Bit 2)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK2_Msk      (0x4UL)                   /*!< BANK2 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK1_Pos      (1UL)                     /*!< BANK1 (Bit 1)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK1_Msk      (0x2UL)                   /*!< BANK1 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SRAMPWRDIS_BANK0_Pos      (0UL)                     /*!< BANK0 (Bit 0)                                         */
#define MCUCTRL_SRAMPWRDIS_BANK0_Msk      (0x1UL)                   /*!< BANK0 (Bitfield-Mask: 0x01)                           */
/* ======================================================  FLASHPWRDIS  ====================================================== */
#define MCUCTRL_FLASHPWRDIS_BANK1_Pos     (1UL)                     /*!< BANK1 (Bit 1)                                         */
#define MCUCTRL_FLASHPWRDIS_BANK1_Msk     (0x2UL)                   /*!< BANK1 (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_FLASHPWRDIS_BANK0_Pos     (0UL)                     /*!< BANK0 (Bit 0)                                         */
#define MCUCTRL_FLASHPWRDIS_BANK0_Msk     (0x1UL)                   /*!< BANK0 (Bitfield-Mask: 0x01)                           */
/* ====================================================  ICODEFAULTADDR  ===================================================== */
#define MCUCTRL_ICODEFAULTADDR_ADDR_Pos   (0UL)                     /*!< ADDR (Bit 0)                                          */
#define MCUCTRL_ICODEFAULTADDR_ADDR_Msk   (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ====================================================  DCODEFAULTADDR  ===================================================== */
#define MCUCTRL_DCODEFAULTADDR_ADDR_Pos   (0UL)                     /*!< ADDR (Bit 0)                                          */
#define MCUCTRL_DCODEFAULTADDR_ADDR_Msk   (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* =====================================================  SYSFAULTADDR  ====================================================== */
#define MCUCTRL_SYSFAULTADDR_ADDR_Pos     (0UL)                     /*!< ADDR (Bit 0)                                          */
#define MCUCTRL_SYSFAULTADDR_ADDR_Msk     (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ======================================================  FAULTSTATUS  ====================================================== */
#define MCUCTRL_FAULTSTATUS_SYS_Pos       (2UL)                     /*!< SYS (Bit 2)                                           */
#define MCUCTRL_FAULTSTATUS_SYS_Msk       (0x4UL)                   /*!< SYS (Bitfield-Mask: 0x01)                             */
#define MCUCTRL_FAULTSTATUS_DCODE_Pos     (1UL)                     /*!< DCODE (Bit 1)                                         */
#define MCUCTRL_FAULTSTATUS_DCODE_Msk     (0x2UL)                   /*!< DCODE (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_FAULTSTATUS_ICODE_Pos     (0UL)                     /*!< ICODE (Bit 0)                                         */
#define MCUCTRL_FAULTSTATUS_ICODE_Msk     (0x1UL)                   /*!< ICODE (Bitfield-Mask: 0x01)                           */
/* ====================================================  FAULTCAPTUREEN  ===================================================== */
#define MCUCTRL_FAULTCAPTUREEN_ENABLE_Pos (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define MCUCTRL_FAULTCAPTUREEN_ENABLE_Msk (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =======================================================  TPIUCTRL  ======================================================== */
#define MCUCTRL_TPIUCTRL_CLKSEL_Pos       (8UL)                     /*!< CLKSEL (Bit 8)                                        */
#define MCUCTRL_TPIUCTRL_CLKSEL_Msk       (0x300UL)                 /*!< CLKSEL (Bitfield-Mask: 0x03)                          */
#define MCUCTRL_TPIUCTRL_ENABLE_Pos       (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define MCUCTRL_TPIUCTRL_ENABLE_Msk       (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
#define RSTGEN_CFG_WDREN_Pos              (1UL)                     /*!< WDREN (Bit 1)                                         */
#define RSTGEN_CFG_WDREN_Msk              (0x2UL)                   /*!< WDREN (Bitfield-Mask: 0x01)                           */
#define RSTGEN_CFG_BODHREN_Pos            (0UL)                     /*!< BODHREN (Bit 0)                                       */
#define RSTGEN_CFG_BODHREN_Msk            (0x1UL)                   /*!< BODHREN (Bitfield-Mask: 0x01)                         */
/* =========================================================  SWPOI  ========================================================= */
#define RSTGEN_SWPOI_SWPOIKEY_Pos         (0UL)                     /*!< SWPOIKEY (Bit 0)                                      */
#define RSTGEN_SWPOI_SWPOIKEY_Msk         (0xffUL)                  /*!< SWPOIKEY (Bitfield-Mask: 0xff)                        */
/* =========================================================  SWPOR  ========================================================= */
#define RSTGEN_SWPOR_SWPORKEY_Pos         (0UL)                     /*!< SWPORKEY (Bit 0)                                      */
#define RSTGEN_SWPOR_SWPORKEY_Msk         (0xffUL)                  /*!< SWPORKEY (Bitfield-Mask: 0xff)                        */
/* =========================================================  STAT  ========================================================== */
#define RSTGEN_STAT_WDRSTAT_Pos           (6UL)                     /*!< WDRSTAT (Bit 6)                                       */
#define RSTGEN_STAT_WDRSTAT_Msk           (0x40UL)                  /*!< WDRSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_DBGRSTAT_Pos          (5UL)                     /*!< DBGRSTAT (Bit 5)                                      */
#define RSTGEN_STAT_DBGRSTAT_Msk          (0x20UL)                  /*!< DBGRSTAT (Bitfield-Mask: 0x01)                        */
#define RSTGEN_STAT_POIRSTAT_Pos          (4UL)                     /*!< POIRSTAT (Bit 4)                                      */
#define RSTGEN_STAT_POIRSTAT_Msk          (0x10UL)                  /*!< POIRSTAT (Bitfield-Mask: 0x01)                        */
#define RSTGEN_STAT_SWRSTAT_Pos           (3UL)                     /*!< SWRSTAT (Bit 3)                                       */
#define RSTGEN_STAT_SWRSTAT_Msk           (0x8UL)                   /*!< SWRSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_BORSTAT_Pos           (2UL)                     /*!< BORSTAT (Bit 2)                                       */
#define RSTGEN_STAT_BORSTAT_Msk           (0x4UL)                   /*!< BORSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_PORSTAT_Pos           (1UL)                     /*!< PORSTAT (Bit 1)                                       */
#define RSTGEN_STAT_PORSTAT_Msk           (0x2UL)                   /*!< PORSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_EXRSTAT_Pos           (0UL)                     /*!< EXRSTAT (Bit 0)                                       */
#define RSTGEN_STAT_EXRSTAT_Msk           (0x1UL)                   /*!< EXRSTAT (Bitfield-Mask: 0x01)                         */
/* ========================================================  CLRSTAT  ======================================================== */
#define RSTGEN_CLRSTAT_CLRSTAT_Pos        (0UL)                     /*!< CLRSTAT (Bit 0)                                       */
#define RSTGEN_CLRSTAT_CLRSTAT_Msk        (0x1UL)                   /*!< CLRSTAT (Bitfield-Mask: 0x01)                         */
/* =========================================================  INTEN  ========================================================= */
#define RSTGEN_INTEN_BODH_Pos             (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTEN_BODH_Msk             (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTSTAT  ======================================================== */
#define RSTGEN_INTSTAT_BODH_Pos           (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTSTAT_BODH_Msk           (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTCLR  ========================================================= */
#define RSTGEN_INTCLR_BODH_Pos            (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTCLR_BODH_Msk            (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTSET  ========================================================= */
#define RSTGEN_INTSET_BODH_Pos            (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTSET_BODH_Msk            (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

