TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* ==========================================================  DR  =========================================================== */
#define UART_DR_OEDATA_Pos                (11UL)                    /*!< OEDATA (Bit 11)                                       */
#define UART_DR_OEDATA_Msk                (0x800UL)                 /*!< OEDATA (Bitfield-Mask: 0x01)                          */
#define UART_DR_BEDATA_Pos                (10UL)                    /*!< BEDATA (Bit 10)                                       */
#define UART_DR_BEDATA_Msk                (0x400UL)                 /*!< BEDATA (Bitfield-Mask: 0x01)                          */
#define UART_DR_PEDATA_Pos                (9UL)                     /*!< PEDATA (Bit 9)                                        */
#define UART_DR_PEDATA_Msk                (0x200UL)                 /*!< PEDATA (Bitfield-Mask: 0x01)                          */
#define UART_DR_FEDATA_Pos                (8UL)                     /*!< FEDATA (Bit 8)                                        */
#define UART_DR_FEDATA_Msk                (0x100UL)                 /*!< FEDATA (Bitfield-Mask: 0x01)                          */
#define UART_DR_DATA_Pos                  (0UL)                     /*!< DATA (Bit 0)                                          */
#define UART_DR_DATA_Msk                  (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ==========================================================  RSR  ========================================================== */
#define UART_RSR_OESTAT_Pos               (3UL)                     /*!< OESTAT (Bit 3)                                        */
#define UART_RSR_OESTAT_Msk               (0x8UL)                   /*!< OESTAT (Bitfield-Mask: 0x01)                          */
#define UART_RSR_BESTAT_Pos               (2UL)                     /*!< BESTAT (Bit 2)                                        */
#define UART_RSR_BESTAT_Msk               (0x4UL)                   /*!< BESTAT (Bitfield-Mask: 0x01)                          */
#define UART_RSR_PESTAT_Pos               (1UL)                     /*!< PESTAT (Bit 1)                                        */
#define UART_RSR_PESTAT_Msk               (0x2UL)                   /*!< PESTAT (Bitfield-Mask: 0x01)                          */
#define UART_RSR_FESTAT_Pos               (0UL)                     /*!< FESTAT (Bit 0)                                        */
#define UART_RSR_FESTAT_Msk               (0x1UL)                   /*!< FESTAT (Bitfield-Mask: 0x01)                          */
/* ==========================================================  FR  =========================================================== */
#define UART_FR_RI_Pos                    (8UL)                     /*!< RI (Bit 8)                                            */
#define UART_FR_RI_Msk                    (0x100UL)                 /*!< RI (Bitfield-Mask: 0x01)                              */
#define UART_FR_TXFE_Pos                  (7UL)                     /*!< TXFE (Bit 7)                                          */
#define UART_FR_TXFE_Msk                  (0x80UL)                  /*!< TXFE (Bitfield-Mask: 0x01)                            */
#define UART_FR_RXFF_Pos                  (6UL)                     /*!< RXFF (Bit 6)                                          */
#define UART_FR_RXFF_Msk                  (0x40UL)                  /*!< RXFF (Bitfield-Mask: 0x01)                            */
#define UART_FR_TXFF_Pos                  (5UL)                     /*!< TXFF (Bit 5)                                          */
#define UART_FR_TXFF_Msk                  (0x20UL)                  /*!< TXFF (Bitfield-Mask: 0x01)                            */
#define UART_FR_RXFE_Pos                  (4UL)                     /*!< RXFE (Bit 4)                                          */
#define UART_FR_RXFE_Msk                  (0x10UL)                  /*!< RXFE (Bitfield-Mask: 0x01)                            */
#define UART_FR_BUSY_Pos                  (3UL)                     /*!< BUSY (Bit 3)                                          */
#define UART_FR_BUSY_Msk                  (0x8UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define UART_FR_DCD_Pos                   (2UL)                     /*!< DCD (Bit 2)                                           */
#define UART_FR_DCD_Msk                   (0x4UL)                   /*!< DCD (Bitfield-Mask: 0x01)                             */
#define UART_FR_DSR_Pos                   (1UL)                     /*!< DSR (Bit 1)                                           */
#define UART_FR_DSR_Msk                   (0x2UL)                   /*!< DSR (Bitfield-Mask: 0x01)                             */
#define UART_FR_CTS_Pos                   (0UL)                     /*!< CTS (Bit 0)                                           */
#define UART_FR_CTS_Msk                   (0x1UL)                   /*!< CTS (Bitfield-Mask: 0x01)                             */
/* =========================================================  ILPR  ========================================================== */
#define UART_ILPR_ILPDVSR_Pos             (0UL)                     /*!< ILPDVSR (Bit 0)                                       */
#define UART_ILPR_ILPDVSR_Msk             (0xffUL)                  /*!< ILPDVSR (Bitfield-Mask: 0xff)                         */
/* =========================================================  IBRD  ========================================================== */
#define UART_IBRD_DIVINT_Pos              (0UL)                     /*!< DIVINT (Bit 0)                                        */
#define UART_IBRD_DIVINT_Msk              (0xffffUL)                /*!< DIVINT (Bitfield-Mask: 0xffff)                        */
/* =========================================================  FBRD  ========================================================== */
#define UART_FBRD_DIVFRAC_Pos             (0UL)                     /*!< DIVFRAC (Bit 0)                                       */
#define UART_FBRD_DIVFRAC_Msk             (0x3fUL)                  /*!< DIVFRAC (Bitfield-Mask: 0x3f)                         */
/* =========================================================  LCRH  ========================================================== */
#define UART_LCRH_SPS_Pos                 (7UL)                     /*!< SPS (Bit 7)                                           */
#define UART_LCRH_SPS_Msk                 (0x80UL)                  /*!< SPS (Bitfield-Mask: 0x01)                             */
#define UART_LCRH_WLEN_Pos                (5UL)                     /*!< WLEN (Bit 5)                                          */
#define UART_LCRH_WLEN_Msk                (0x60UL)                  /*!< WLEN (Bitfield-Mask: 0x03)                            */
#define UART_LCRH_FEN_Pos                 (4UL)                     /*!< FEN (Bit 4)                                           */
#define UART_LCRH_FEN_Msk                 (0x10UL)                  /*!< FEN (Bitfield-Mask: 0x01)                             */
#define UART_LCRH_STP2_Pos                (3UL)                     /*!< STP2 (Bit 3)                                          */
#define UART_LCRH_STP2_Msk                (0x8UL)                   /*!< STP2 (Bitfield-Mask: 0x01)                            */
#define UART_LCRH_EPS_Pos                 (2UL)                     /*!< EPS (Bit 2)                                           */
#define UART_LCRH_EPS_Msk                 (0x4UL)                   /*!< EPS (Bitfield-Mask: 0x01)                             */
#define UART_LCRH_PEN_Pos                 (1UL)                     /*!< PEN (Bit 1)                                           */
#define UART_LCRH_PEN_Msk                 (0x2UL)                   /*!< PEN (Bitfield-Mask: 0x01)                             */
#define UART_LCRH_BRK_Pos                 (0UL)                     /*!< BRK (Bit 0)                                           */
#define UART_LCRH_BRK_Msk                 (0x1UL)                   /*!< BRK (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CR  =========================================================== */
#define UART_CR_CTSEN_Pos                 (15UL)                    /*!< CTSEN (Bit 15)                                        */
#define UART_CR_CTSEN_Msk                 (0x8000UL)                /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define UART_CR_RTSEN_Pos                 (14UL)                    /*!< RTSEN (Bit 14)                                        */
#define UART_CR_RTSEN_Msk                 (0x4000UL)                /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UART_CR_OUT2_Pos                  (13UL)                    /*!< OUT2 (Bit 13)                                         */
#define UART_CR_OUT2_Msk                  (0x2000UL)                /*!< OUT2 (Bitfield-Mask: 0x01)                            */
#define UART_CR_OUT1_Pos                  (12UL)                    /*!< OUT1 (Bit 12)                                         */
#define UART_CR_OUT1_Msk                  (0x1000UL)                /*!< OUT1 (Bitfield-Mask: 0x01)                            */
#define UART_CR_RTS_Pos                   (11UL)                    /*!< RTS (Bit 11)                                          */
#define UART_CR_RTS_Msk                   (0x800UL)                 /*!< RTS (Bitfield-Mask: 0x01)                             */
#define UART_CR_DTR_Pos                   (10UL)                    /*!< DTR (Bit 10)                                          */
#define UART_CR_DTR_Msk                   (0x400UL)                 /*!< DTR (Bitfield-Mask: 0x01)                             */
#define UART_CR_RXE_Pos                   (9UL)                     /*!< RXE (Bit 9)                                           */
#define UART_CR_RXE_Msk                   (0x200UL)                 /*!< RXE (Bitfield-Mask: 0x01)                             */
#define UART_CR_TXE_Pos                   (8UL)                     /*!< TXE (Bit 8)                                           */
#define UART_CR_TXE_Msk                   (0x100UL)                 /*!< TXE (Bitfield-Mask: 0x01)                             */
#define UART_CR_LBE_Pos                   (7UL)                     /*!< LBE (Bit 7)                                           */
#define UART_CR_LBE_Msk                   (0x80UL)                  /*!< LBE (Bitfield-Mask: 0x01)                             */
#define UART_CR_CLKSEL_Pos                (4UL)                     /*!< CLKSEL (Bit 4)                                        */
#define UART_CR_CLKSEL_Msk                (0x70UL)                  /*!< CLKSEL (Bitfield-Mask: 0x07)                          */
#define UART_CR_CLKEN_Pos                 (3UL)                     /*!< CLKEN (Bit 3)                                         */
#define UART_CR_CLKEN_Msk                 (0x8UL)                   /*!< CLKEN (Bitfield-Mask: 0x01)                           */
#define UART_CR_SIRLP_Pos                 (2UL)                     /*!< SIRLP (Bit 2)                                         */
#define UART_CR_SIRLP_Msk                 (0x4UL)                   /*!< SIRLP (Bitfield-Mask: 0x01)                           */
#define UART_CR_SIREN_Pos                 (1UL)                     /*!< SIREN (Bit 1)                                         */
#define UART_CR_SIREN_Msk                 (0x2UL)                   /*!< SIREN (Bitfield-Mask: 0x01)                           */
#define UART_CR_UARTEN_Pos                (0UL)                     /*!< UARTEN (Bit 0)                                        */
#define UART_CR_UARTEN_Msk                (0x1UL)                   /*!< UARTEN (Bitfield-Mask: 0x01)                          */
/* =========================================================  IFLS  ========================================================== */
#define UART_IFLS_RXIFLSEL_Pos            (3UL)                     /*!< RXIFLSEL (Bit 3)                                      */
#define UART_IFLS_RXIFLSEL_Msk            (0x38UL)                  /*!< RXIFLSEL (Bitfield-Mask: 0x07)                        */
#define UART_IFLS_TXIFLSEL_Pos            (0UL)                     /*!< TXIFLSEL (Bit 0)                                      */
#define UART_IFLS_TXIFLSEL_Msk            (0x7UL)                   /*!< TXIFLSEL (Bitfield-Mask: 0x07)                        */
/* ==========================================================  IER  ========================================================== */
#define UART_IER_OEIM_Pos                 (10UL)                    /*!< OEIM (Bit 10)                                         */
#define UART_IER_OEIM_Msk                 (0x400UL)                 /*!< OEIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_BEIM_Pos                 (9UL)                     /*!< BEIM (Bit 9)                                          */
#define UART_IER_BEIM_Msk                 (0x200UL)                 /*!< BEIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_PEIM_Pos                 (8UL)                     /*!< PEIM (Bit 8)                                          */
#define UART_IER_PEIM_Msk                 (0x100UL)                 /*!< PEIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_FEIM_Pos                 (7UL)                     /*!< FEIM (Bit 7)                                          */
#define UART_IER_FEIM_Msk                 (0x80UL)                  /*!< FEIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_RTIM_Pos                 (6UL)                     /*!< RTIM (Bit 6)                                          */
#define UART_IER_RTIM_Msk                 (0x40UL)                  /*!< RTIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_TXIM_Pos                 (5UL)                     /*!< TXIM (Bit 5)                                          */
#define UART_IER_TXIM_Msk                 (0x20UL)                  /*!< TXIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_RXIM_Pos                 (4UL)                     /*!< RXIM (Bit 4)                                          */
#define UART_IER_RXIM_Msk                 (0x10UL)                  /*!< RXIM (Bitfield-Mask: 0x01)                            */
#define UART_IER_DSRMIM_Pos               (3UL)                     /*!< DSRMIM (Bit 3)                                        */
#define UART_IER_DSRMIM_Msk               (0x8UL)                   /*!< DSRMIM (Bitfield-Mask: 0x01)                          */
#define UART_IER_DCDMIM_Pos               (2UL)                     /*!< DCDMIM (Bit 2)                                        */
#define UART_IER_DCDMIM_Msk               (0x4UL)                   /*!< DCDMIM (Bitfield-Mask: 0x01)                          */
#define UART_IER_CTSMIM_Pos               (1UL)                     /*!< CTSMIM (Bit 1)                                        */
#define UART_IER_CTSMIM_Msk               (0x2UL)                   /*!< CTSMIM (Bitfield-Mask: 0x01)                          */
#define UART_IER_RIMIM_Pos                (0UL)                     /*!< RIMIM (Bit 0)                                         */
#define UART_IER_RIMIM_Msk                (0x1UL)                   /*!< RIMIM (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IES  ========================================================== */
#define UART_IES_OERIS_Pos                (10UL)                    /*!< OERIS (Bit 10)                                        */
#define UART_IES_OERIS_Msk                (0x400UL)                 /*!< OERIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_BERIS_Pos                (9UL)                     /*!< BERIS (Bit 9)                                         */
#define UART_IES_BERIS_Msk                (0x200UL)                 /*!< BERIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_PERIS_Pos                (8UL)                     /*!< PERIS (Bit 8)                                         */
#define UART_IES_PERIS_Msk                (0x100UL)                 /*!< PERIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_FERIS_Pos                (7UL)                     /*!< FERIS (Bit 7)                                         */
#define UART_IES_FERIS_Msk                (0x80UL)                  /*!< FERIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_RTRIS_Pos                (6UL)                     /*!< RTRIS (Bit 6)                                         */
#define UART_IES_RTRIS_Msk                (0x40UL)                  /*!< RTRIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_TXRIS_Pos                (5UL)                     /*!< TXRIS (Bit 5)                                         */
#define UART_IES_TXRIS_Msk                (0x20UL)                  /*!< TXRIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_RXRIS_Pos                (4UL)                     /*!< RXRIS (Bit 4)                                         */
#define UART_IES_RXRIS_Msk                (0x10UL)                  /*!< RXRIS (Bitfield-Mask: 0x01)                           */
#define UART_IES_DSRMRIS_Pos              (3UL)                     /*!< DSRMRIS (Bit 3)                                       */
#define UART_IES_DSRMRIS_Msk              (0x8UL)                   /*!< DSRMRIS (Bitfield-Mask: 0x01)                         */
#define UART_IES_DCDMRIS_Pos              (2UL)                     /*!< DCDMRIS (Bit 2)                                       */
#define UART_IES_DCDMRIS_Msk              (0x4UL)                   /*!< DCDMRIS (Bitfield-Mask: 0x01)                         */
#define UART_IES_CTSMRIS_Pos              (1UL)                     /*!< CTSMRIS (Bit 1)                                       */
#define UART_IES_CTSMRIS_Msk              (0x2UL)                   /*!< CTSMRIS (Bitfield-Mask: 0x01)                         */
#define UART_IES_RIMRIS_Pos               (0UL)                     /*!< RIMRIS (Bit 0)                                        */
#define UART_IES_RIMRIS_Msk               (0x1UL)                   /*!< RIMRIS (Bitfield-Mask: 0x01)                          */
/* ==========================================================  MIS  ========================================================== */
#define UART_MIS_OEMIS_Pos                (10UL)                    /*!< OEMIS (Bit 10)                                        */
#define UART_MIS_OEMIS_Msk                (0x400UL)                 /*!< OEMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_BEMIS_Pos                (9UL)                     /*!< BEMIS (Bit 9)                                         */
#define UART_MIS_BEMIS_Msk                (0x200UL)                 /*!< BEMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_PEMIS_Pos                (8UL)                     /*!< PEMIS (Bit 8)                                         */
#define UART_MIS_PEMIS_Msk                (0x100UL)                 /*!< PEMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_FEMIS_Pos                (7UL)                     /*!< FEMIS (Bit 7)                                         */
#define UART_MIS_FEMIS_Msk                (0x80UL)                  /*!< FEMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_RTMIS_Pos                (6UL)                     /*!< RTMIS (Bit 6)                                         */
#define UART_MIS_RTMIS_Msk                (0x40UL)                  /*!< RTMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_TXMIS_Pos                (5UL)                     /*!< TXMIS (Bit 5)                                         */
#define UART_MIS_TXMIS_Msk                (0x20UL)                  /*!< TXMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_RXMIS_Pos                (4UL)                     /*!< RXMIS (Bit 4)                                         */
#define UART_MIS_RXMIS_Msk                (0x10UL)                  /*!< RXMIS (Bitfield-Mask: 0x01)                           */
#define UART_MIS_DSRMMIS_Pos              (3UL)                     /*!< DSRMMIS (Bit 3)                                       */
#define UART_MIS_DSRMMIS_Msk              (0x8UL)                   /*!< DSRMMIS (Bitfield-Mask: 0x01)                         */
#define UART_MIS_DCDMMIS_Pos              (2UL)                     /*!< DCDMMIS (Bit 2)                                       */
#define UART_MIS_DCDMMIS_Msk              (0x4UL)                   /*!< DCDMMIS (Bitfield-Mask: 0x01)                         */
#define UART_MIS_CTSMMIS_Pos              (1UL)                     /*!< CTSMMIS (Bit 1)                                       */
#define UART_MIS_CTSMMIS_Msk              (0x2UL)                   /*!< CTSMMIS (Bitfield-Mask: 0x01)                         */
#define UART_MIS_RIMMIS_Pos               (0UL)                     /*!< RIMMIS (Bit 0)                                        */
#define UART_MIS_RIMMIS_Msk               (0x1UL)                   /*!< RIMMIS (Bitfield-Mask: 0x01)                          */
/* ==========================================================  IEC  ========================================================== */
#define UART_IEC_OEIC_Pos                 (10UL)                    /*!< OEIC (Bit 10)                                         */
#define UART_IEC_OEIC_Msk                 (0x400UL)                 /*!< OEIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_BEIC_Pos                 (9UL)                     /*!< BEIC (Bit 9)                                          */
#define UART_IEC_BEIC_Msk                 (0x200UL)                 /*!< BEIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_PEIC_Pos                 (8UL)                     /*!< PEIC (Bit 8)                                          */
#define UART_IEC_PEIC_Msk                 (0x100UL)                 /*!< PEIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_FEIC_Pos                 (7UL)                     /*!< FEIC (Bit 7)                                          */
#define UART_IEC_FEIC_Msk                 (0x80UL)                  /*!< FEIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_RTIC_Pos                 (6UL)                     /*!< RTIC (Bit 6)                                          */
#define UART_IEC_RTIC_Msk                 (0x40UL)                  /*!< RTIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_TXIC_Pos                 (5UL)                     /*!< TXIC (Bit 5)                                          */
#define UART_IEC_TXIC_Msk                 (0x20UL)                  /*!< TXIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_RXIC_Pos                 (4UL)                     /*!< RXIC (Bit 4)                                          */
#define UART_IEC_RXIC_Msk                 (0x10UL)                  /*!< RXIC (Bitfield-Mask: 0x01)                            */
#define UART_IEC_DSRMIC_Pos               (3UL)                     /*!< DSRMIC (Bit 3)                                        */
#define UART_IEC_DSRMIC_Msk               (0x8UL)                   /*!< DSRMIC (Bitfield-Mask: 0x01)                          */
#define UART_IEC_DCDMIC_Pos               (2UL)                     /*!< DCDMIC (Bit 2)                                        */
