TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* =================================================  ADC CFG OPMODE [5..6]  ================================================= */
typedef enum {                                  /*!< ADC_CFG_OPMODE                                                            */
  ADC_CFG_OPMODE_SAMPLE_RATE_LE_125KSPS = 0,    /*!< SAMPLE_RATE_LE_125KSPS : Sample Rate <= 125K sps                          */
  ADC_CFG_OPMODE_SAMPLE_RATE_125K_1MSPS = 2,    /*!< SAMPLE_RATE_125K_1MSPS : Sample Rate 125K to 1M sps                       */
} ADC_CFG_OPMODE_Enum;

/* =================================================  ADC CFG LPMODE [3..4]  ================================================= */
typedef enum {                                  /*!< ADC_CFG_LPMODE                                                            */
  ADC_CFG_LPMODE_MODE0                 = 0,     /*!< MODE0 : Low Power Mode 0 (2'b00). Leaves the ADC fully powered
                                                                    between scans with no latency between a
                                                                    trigger event and sample data collection.                  */
  ADC_CFG_LPMODE_MODE1                 = 1,     /*!< MODE1 : Low Power Mode 1 (2'b01). Enables a low power mode for
                                                     the ADC between scans requiring 50us initialization time
                                                     (latency) between a trigger event and the scan (assuming
                                                     the HFRC remains running and the MCU is not in deepsleep
                                                     mode in which case additional startup latency for HFRC
                                                     startup is required).                                                     */
  ADC_CFG_LPMODE_MODE2                 = 2,     /*!< MODE2 : Low Power Mode 2 (2'b10). Disconnects power and clocks
                                                     to the ADC effectively eliminating all active power associated
                                                     with the ADC between scans. This mode requires 150us initialization
                                                     (again, assuming the HFRC remains running and the MCU is
                                                     not in deepsleep mode in which case additional startup
                                                     latency for HFRC startup is required).                                    */
  ADC_CFG_LPMODE_MODE_UNDEFINED        = 3,     /*!< MODE_UNDEFINED : Undefined Mode (2'b11)                                   */
} ADC_CFG_LPMODE_Enum;

/* =================================================  ADC CFG RPTEN [2..2]  ================================================== */
typedef enum {                                  /*!< ADC_CFG_RPTEN                                                             */
  ADC_CFG_RPTEN_SINGLE_SCAN            = 0,     /*!< SINGLE_SCAN : In Single Scan Mode, the ADC will complete a single
                                                     scan upon each trigger event.                                             */
  ADC_CFG_RPTEN_REPEATING_SCAN         = 1,     /*!< REPEATING_SCAN : In Repeating Scan Mode, the ADC will complete
                                                     it's first scan upon the initial trigger event and all
                                                     subsequent scans will occur at regular intervals defined
                                                     by the configuration programmed for the CTTMRA3 internal
                                                     timer until the timer is disabled or the ADC is disabled.                 */
} ADC_CFG_RPTEN_Enum;

/* ================================================  ADC CFG TMPSPWR [1..1]  ================================================= */
typedef enum {                                  /*!< ADC_CFG_TMPSPWR                                                           */
  ADC_CFG_TMPSPWR_DIS                  = 0,     /*!< DIS : Power down the temperature sensor.                                  */
  ADC_CFG_TMPSPWR_EN                   = 1,     /*!< EN : Enable the temperature sensor when the ADC is in it's active
                                                     state.                                                                    */
} ADC_CFG_TMPSPWR_Enum;

/* =================================================  ADC CFG ADCEN [0..0]  ================================================== */
typedef enum {                                  /*!< ADC_CFG_ADCEN                                                             */
  ADC_CFG_ADCEN_DIS                    = 0,     /*!< DIS : Disable the ADC module.                                             */
  ADC_CFG_ADCEN_EN                     = 1,     /*!< EN : Enable the ADC module.                                               */
} ADC_CFG_ADCEN_Enum;

/* =========================================================  STAT  ========================================================== */
/* ================================================  ADC STAT PWDSTAT [0..1]  ================================================ */
typedef enum {                                  /*!< ADC_STAT_PWDSTAT                                                          */
  ADC_STAT_PWDSTAT_ON                  = 0,     /*!< ON : Powered on.                                                          */
  ADC_STAT_PWDSTAT_SWITCH_ON_SAR_OFF   = 1,     /*!< SWITCH_ON_SAR_OFF : Power switch on, ADC Low Power Mode 1.                */
  ADC_STAT_PWDSTAT_POWER_SWITCH_OFF    = 2,     /*!< POWER_SWITCH_OFF : Power switch off, ADC disabled.                        */
} ADC_STAT_PWDSTAT_Enum;

/* ==========================================================  SWT  ========================================================== */
/* ==================================================  ADC SWT SWT [0..7]  =================================================== */
typedef enum {                                  /*!< ADC_SWT_SWT                                                               */
  ADC_SWT_SWT_GEN_SW_TRIGGER           = 55,    /*!< GEN_SW_TRIGGER : Writing this value generates a software trigger.         */
} ADC_SWT_SWT_Enum;

