TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* ==============================================  ADC SL5CFG THSEL5 [16..18]  =============================================== */
typedef enum {                                  /*!< ADC_SL5CFG_THSEL5                                                         */
  ADC_SL5CFG_THSEL5_1_ADC_CLK          = 0,     /*!< 1_ADC_CLK : 1 ADC clock cycle.                                            */
  ADC_SL5CFG_THSEL5_2_ADC_CLKS         = 1,     /*!< 2_ADC_CLKS : 2 ADC clock cycles.                                          */
  ADC_SL5CFG_THSEL5_4_ADC_CLKS         = 2,     /*!< 4_ADC_CLKS : 4 ADC clock cycles.                                          */
  ADC_SL5CFG_THSEL5_8_ADC_CLKS         = 3,     /*!< 8_ADC_CLKS : 8 ADC clock cycles.                                          */
  ADC_SL5CFG_THSEL5_16_ADC_CLKS        = 4,     /*!< 16_ADC_CLKS : 16 ADC clock cycles.                                        */
  ADC_SL5CFG_THSEL5_32_ADC_CLKS        = 5,     /*!< 32_ADC_CLKS : 32 ADC clock cycles.                                        */
  ADC_SL5CFG_THSEL5_64_ADC_CLKS        = 6,     /*!< 64_ADC_CLKS : 64 ADC clock cycles.                                        */
  ADC_SL5CFG_THSEL5_128_ADC_CLKS       = 7,     /*!< 128_ADC_CLKS : 128 ADC clock cycles.                                      */
} ADC_SL5CFG_THSEL5_Enum;

/* ===============================================  ADC SL5CFG CHSEL5 [8..11]  =============================================== */
typedef enum {                                  /*!< ADC_SL5CFG_CHSEL5                                                         */
  ADC_SL5CFG_CHSEL5_EXT0               = 0,     /*!< EXT0 : ADC_EXT0 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT1               = 1,     /*!< EXT1 : ADC_EXT1 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT2               = 2,     /*!< EXT2 : ADC_EXT2 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT3               = 3,     /*!< EXT3 : ADC_EXT3 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT4               = 4,     /*!< EXT4 : ADC_EXT4 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT5               = 5,     /*!< EXT5 : ADC_EXT5 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT6               = 6,     /*!< EXT6 : ADC_EXT6 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_EXT7               = 7,     /*!< EXT7 : ADC_EXT7 external GPIO pin connection.                             */
  ADC_SL5CFG_CHSEL5_TEMP               = 8,     /*!< TEMP : ADC_TEMP internal temperature sensor.                              */
  ADC_SL5CFG_CHSEL5_VDD                = 9,     /*!< VDD : ADC_VDD internal power rail connection.                             */
  ADC_SL5CFG_CHSEL5_VSS                = 10,    /*!< VSS : ADC_VSS internal ground connection.                                 */
  ADC_SL5CFG_CHSEL5_VBATT              = 12,    /*!< VBATT : ADC_VBATT internal voltage divide-by-3 connection to
                                                     input power rail.                                                         */
} ADC_SL5CFG_CHSEL5_Enum;

/* ================================================  ADC SL5CFG WCEN5 [1..1]  ================================================ */
typedef enum {                                  /*!< ADC_SL5CFG_WCEN5                                                          */
  ADC_SL5CFG_WCEN5_WCEN                = 1,     /*!< WCEN : Enable the window compare for slot 5.                              */
} ADC_SL5CFG_WCEN5_Enum;

/* ================================================  ADC SL5CFG SLEN5 [0..0]  ================================================ */
typedef enum {                                  /*!< ADC_SL5CFG_SLEN5                                                          */
  ADC_SL5CFG_SLEN5_SLEN                = 1,     /*!< SLEN : Enable slot 5 for ADC conversions.                                 */
} ADC_SL5CFG_SLEN5_Enum;

/* ========================================================  SL6CFG  ========================================================= */
/* ==============================================  ADC SL6CFG ADSEL6 [24..26]  =============================================== */
typedef enum {                                  /*!< ADC_SL6CFG_ADSEL6                                                         */
  ADC_SL6CFG_ADSEL6_AVG_1_MSRMT        = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  ADC_SL6CFG_ADSEL6_AVG_2_MSRMTS       = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  ADC_SL6CFG_ADSEL6_AVG_4_MSRMTS       = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  ADC_SL6CFG_ADSEL6_AVG_8_MSRMT        = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  ADC_SL6CFG_ADSEL6_AVG_16_MSRMTS      = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  ADC_SL6CFG_ADSEL6_AVG_32_MSRMTS      = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  ADC_SL6CFG_ADSEL6_AVG_64_MSRMTS      = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  ADC_SL6CFG_ADSEL6_AVG_128_MSRMTS     = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} ADC_SL6CFG_ADSEL6_Enum;

