TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* ========================================================  PADKEY  ========================================================= */
/* ==============================================  GPIO PADKEY PADKEY [0..31]  =============================================== */
typedef enum {                                  /*!< GPIO_PADKEY_PADKEY                                                        */
  GPIO_PADKEY_PADKEY_Key               = 115,   /*!< Key : Key                                                                 */
} GPIO_PADKEY_PADKEY_Enum;

/* ==========================================================  RDA  ========================================================== */
/* ==========================================================  RDB  ========================================================== */
/* ==========================================================  WTA  ========================================================== */
/* ==========================================================  WTB  ========================================================== */
/* =========================================================  WTSA  ========================================================== */
/* =========================================================  WTSB  ========================================================== */
/* =========================================================  WTCA  ========================================================== */
/* =========================================================  WTCB  ========================================================== */
/* ==========================================================  ENA  ========================================================== */
/* ==========================================================  ENB  ========================================================== */
/* =========================================================  ENSA  ========================================================== */
/* =========================================================  ENSB  ========================================================== */
/* =========================================================  ENCA  ========================================================== */
/* =========================================================  ENCB  ========================================================== */
/* ========================================================  INT0EN  ========================================================= */
/* =======================================================  INT0STAT  ======================================================== */
/* ========================================================  INT0CLR  ======================================================== */
/* ========================================================  INT0SET  ======================================================== */
/* ========================================================  INT1EN  ========================================================= */
/* =======================================================  INT1STAT  ======================================================== */
/* ========================================================  INT1CLR  ======================================================== */
/* ========================================================  INT1SET  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          IOMSTR0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  FIFO  ========================================================== */
/* ========================================================  FIFOPTR  ======================================================== */
/* ========================================================  TLNGTH  ========================================================= */
/* ========================================================  FIFOTHR  ======================================================== */
/* ========================================================  CLKCFG  ========================================================= */
/* =============================================  IOMSTR0 CLKCFG DIVEN [12..12]  ============================================= */
typedef enum {                                  /*!< IOMSTR0_CLKCFG_DIVEN                                                      */
  IOMSTR0_CLKCFG_DIVEN_DIS             = 0,     /*!< DIS : Disable TOTPER division.                                            */
  IOMSTR0_CLKCFG_DIVEN_EN              = 1,     /*!< EN : Enable TOTPER division.                                              */
} IOMSTR0_CLKCFG_DIVEN_Enum;

/* =============================================  IOMSTR0 CLKCFG DIV3 [11..11]  ============================================== */
typedef enum {                                  /*!< IOMSTR0_CLKCFG_DIV3                                                       */
  IOMSTR0_CLKCFG_DIV3_DIS              = 0,     /*!< DIS : Select divide by 1.                                                 */
  IOMSTR0_CLKCFG_DIV3_EN               = 1,     /*!< EN : Select divide by 3.                                                  */
} IOMSTR0_CLKCFG_DIV3_Enum;

/* ==============================================  IOMSTR0 CLKCFG FSEL [8..10]  ============================================== */
typedef enum {                                  /*!< IOMSTR0_CLKCFG_FSEL                                                       */
  IOMSTR0_CLKCFG_FSEL_HFRC_DIV64       = 0,     /*!< HFRC_DIV64 : Selects the HFRC / 64 as the input clock.                    */
  IOMSTR0_CLKCFG_FSEL_HFRC             = 1,     /*!< HFRC : Selects the HFRC as the input clock.                               */
  IOMSTR0_CLKCFG_FSEL_HFRC_DIV2        = 2,     /*!< HFRC_DIV2 : Selects the HFRC / 2 as the input clock.                      */
  IOMSTR0_CLKCFG_FSEL_HFRC_DIV4        = 3,     /*!< HFRC_DIV4 : Selects the HFRC / 4 as the input clock.                      */
  IOMSTR0_CLKCFG_FSEL_HFRC_DIV8        = 4,     /*!< HFRC_DIV8 : Selects the HFRC / 8 as the input clock.                      */
  IOMSTR0_CLKCFG_FSEL_HFRC_DIV16       = 5,     /*!< HFRC_DIV16 : Selects the HFRC / 16 as the input clock.                    */
  IOMSTR0_CLKCFG_FSEL_HFRC_DIV32       = 6,     /*!< HFRC_DIV32 : Selects the HFRC / 32 as the input clock.                    */
} IOMSTR0_CLKCFG_FSEL_Enum;

/* ==========================================================  CMD  ========================================================== */
/* ================================================  IOMSTR0 CMD CMD [0..31]  ================================================ */
typedef enum {                                  /*!< IOMSTR0_CMD_CMD                                                           */
  IOMSTR0_CMD_CMD_POS_LENGTH           = 0,     /*!< POS_LENGTH : LSB bit position of the CMD LENGTH field.                    */
  IOMSTR0_CMD_CMD_POS_OFFSET           = 8,     /*!< POS_OFFSET : LSB bit position of the CMD OFFSET field.                    */
  IOMSTR0_CMD_CMD_POS_ADDRESS          = 16,    /*!< POS_ADDRESS : LSB bit position of the I2C CMD ADDRESS field.              */
  IOMSTR0_CMD_CMD_POS_UPLNGTH          = 23,    /*!< POS_UPLNGTH : LSB bit position of the SPI CMD UPLNGTH field.              */
  IOMSTR0_CMD_CMD_POS_10BIT            = 26,    /*!< POS_10BIT : LSB bit position of the I2C CMD 10-bit field.                 */
  IOMSTR0_CMD_CMD_POS_LSB              = 27,    /*!< POS_LSB : LSB bit position of the CMD LSB-first field.                    */
  IOMSTR0_CMD_CMD_POS_CONT             = 28,    /*!< POS_CONT : LSB bit position of the CMD CONTinue field.                    */
  IOMSTR0_CMD_CMD_POS_OPER             = 29,    /*!< POS_OPER : LSB bit position of the CMD OPERation field.                   */
  IOMSTR0_CMD_CMD_MSK_LENGTH           = 255,   /*!< MSK_LENGTH : LSB bit mask of the CMD LENGTH field.                        */
  IOMSTR0_CMD_CMD_MSK_OFFSET           = 65280, /*!< MSK_OFFSET : LSB bit mask of the CMD OFFSET field.                        */
  IOMSTR0_CMD_CMD_MSK_ADDRESS          = 16711680,/*!< MSK_ADDRESS : LSB bit mask of the I2C CMD ADDRESS field.                */
  IOMSTR0_CMD_CMD_MSK_CHNL             = 458752,/*!< MSK_CHNL : LSB bit mask of the SPI CMD CHANNEL field.                     */
  IOMSTR0_CMD_CMD_MSK_UPLNGTH          = 125829120,/*!< MSK_UPLNGTH : LSB bit mask of the SPI CMD UPLNGTH field.               */
  IOMSTR0_CMD_CMD_MSK_10BIT            = 67108864,/*!< MSK_10BIT : LSB bit mask of the I2C CMD 10-bit field.                   */
  IOMSTR0_CMD_CMD_MSK_LSB              = 134217728,/*!< MSK_LSB : LSB bit mask of the CMD LSB-first field.                     */
  IOMSTR0_CMD_CMD_MSK_CONT             = 268435456,/*!< MSK_CONT : LSB bit mask of the CMD CONTinue field.                     */
  IOMSTR0_CMD_CMD_MSK_OPER             = -536870912,/*!< MSK_OPER : LSB bit mask of the CMD OPERation field.                   */
} IOMSTR0_CMD_CMD_Enum;

/* ========================================================  CMDRPT  ========================================================= */
/* ========================================================  STATUS  ========================================================= */
/* =============================================  IOMSTR0 STATUS IDLEST [2..2]  ============================================== */
typedef enum {                                  /*!< IOMSTR0_STATUS_IDLEST                                                     */
  IOMSTR0_STATUS_IDLEST_IDLE           = 1,     /*!< IDLE : The I/O state machine is in the idle state.                        */
} IOMSTR0_STATUS_IDLEST_Enum;

/* =============================================  IOMSTR0 STATUS CMDACT [1..1]  ============================================== */
typedef enum {                                  /*!< IOMSTR0_STATUS_CMDACT                                                     */
  IOMSTR0_STATUS_CMDACT_ACTIVE         = 1,     /*!< ACTIVE : An I/O command is active.                                        */
} IOMSTR0_STATUS_CMDACT_Enum;

/* ===============================================  IOMSTR0 STATUS ERR [0..0]  =============================================== */
typedef enum {                                  /*!< IOMSTR0_STATUS_ERR                                                        */
  IOMSTR0_STATUS_ERR_ERROR             = 1,     /*!< ERROR : An error has been indicated by the IOM.                           */
} IOMSTR0_STATUS_ERR_Enum;

/* ==========================================================  CFG  ========================================================== */
/* ==============================================  IOMSTR0 CFG IFCEN [31..31]  =============================================== */
typedef enum {                                  /*!< IOMSTR0_CFG_IFCEN                                                         */
  IOMSTR0_CFG_IFCEN_DIS                = 0,     /*!< DIS : Disable the IO Master.                                              */
  IOMSTR0_CFG_IFCEN_EN                 = 1,     /*!< EN : Enable the IO Master.                                                */
} IOMSTR0_CFG_IFCEN_Enum;

/* ================================================  IOMSTR0 CFG SPHA [2..2]  ================================================ */
typedef enum {                                  /*!< IOMSTR0_CFG_SPHA                                                          */
  IOMSTR0_CFG_SPHA_SAMPLE_LEADING_EDGE = 0,     /*!< SAMPLE_LEADING_EDGE : Sample on the leading (first) clock edge.           */
  IOMSTR0_CFG_SPHA_SAMPLE_TRAILING_EDGE = 1,    /*!< SAMPLE_TRAILING_EDGE : Sample on the trailing (second) clock
                                                     edge.                                                                     */
} IOMSTR0_CFG_SPHA_Enum;

