TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* =============================================  MCUCTRL CHIP_INFO PKG [6..7]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIP_INFO_PKG                                                     */
  MCUCTRL_CHIP_INFO_PKG_BGA            = 2,     /*!< BGA : Ball grid array.                                                    */
  MCUCTRL_CHIP_INFO_PKG_CSP            = 3,     /*!< CSP : Chip-scale package.                                                 */
} MCUCTRL_CHIP_INFO_PKG_Enum;

/* =============================================  MCUCTRL CHIP_INFO PINS [3..5]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIP_INFO_PINS                                                    */
  MCUCTRL_CHIP_INFO_PINS_41PINS        = 1,     /*!< 41PINS : 41 package pins total.                                           */
} MCUCTRL_CHIP_INFO_PINS_Enum;

/* =============================================  MCUCTRL CHIP_INFO TEMP [1..2]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIP_INFO_TEMP                                                    */
  MCUCTRL_CHIP_INFO_TEMP_COMMERCIAL    = 0,     /*!< COMMERCIAL : Commercial temperature range.                                */
} MCUCTRL_CHIP_INFO_TEMP_Enum;

/* =============================================  MCUCTRL CHIP_INFO QUAL [0..0]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIP_INFO_QUAL                                                    */
  MCUCTRL_CHIP_INFO_QUAL_PROTOTYPE     = 0,     /*!< PROTOTYPE : Prototype device.                                             */
  MCUCTRL_CHIP_INFO_QUAL_QUALIFIED     = 1,     /*!< QUALIFIED : Fully qualified device.                                       */
} MCUCTRL_CHIP_INFO_QUAL_Enum;

/* ========================================================  CHIPID0  ======================================================== */
/* =============================================  MCUCTRL CHIPID0 VALUE [0..31]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPID0_VALUE                                                     */
  MCUCTRL_CHIPID0_VALUE_APOLLO         = 0,     /*!< APOLLO : Apollo CHIPID0.                                                  */
} MCUCTRL_CHIPID0_VALUE_Enum;

/* ========================================================  CHIPID1  ======================================================== */
/* =============================================  MCUCTRL CHIPID1 VALUE [0..31]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPID1_VALUE                                                     */
  MCUCTRL_CHIPID1_VALUE_APOLLO         = 0,     /*!< APOLLO : Apollo CHIPID1.                                                  */
} MCUCTRL_CHIPID1_VALUE_Enum;

/* ========================================================  CHIPREV  ======================================================== */
/* ============================================  MCUCTRL CHIPREV REVISION [0..7]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVISION                                                  */
  MCUCTRL_CHIPREV_REVISION_APOLLO      = 0,     /*!< APOLLO : Apollo CHIPREV.                                                  */
} MCUCTRL_CHIPREV_REVISION_Enum;

/* =======================================================  SUPPLYSRC  ======================================================= */
/* ==========================================  MCUCTRL SUPPLYSRC COREBUCKEN [1..1]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SUPPLYSRC_COREBUCKEN                                              */
  MCUCTRL_SUPPLYSRC_COREBUCKEN_EN      = 1,     /*!< EN : Enable the Core Buck for the low-voltage power domain.               */
} MCUCTRL_SUPPLYSRC_COREBUCKEN_Enum;

/* ==========================================  MCUCTRL SUPPLYSRC MEMBUCKEN [0..0]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_SUPPLYSRC_MEMBUCKEN                                               */
  MCUCTRL_SUPPLYSRC_MEMBUCKEN_EN       = 1,     /*!< EN : Enable the Memory Buck as the supply for flash and SRAM.             */
} MCUCTRL_SUPPLYSRC_MEMBUCKEN_Enum;

/* =====================================================  SUPPLYSTATUS  ====================================================== */
/* ========================================  MCUCTRL SUPPLYSTATUS COREBUCKON [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SUPPLYSTATUS_COREBUCKON                                           */
  MCUCTRL_SUPPLYSTATUS_COREBUCKON_LDO  = 0,     /*!< LDO : Indicates the the LDO is supplying the Core low-voltage.            */
  MCUCTRL_SUPPLYSTATUS_COREBUCKON_BUCK = 1,     /*!< BUCK : Indicates the the Buck is supplying the Core low-voltage.          */
} MCUCTRL_SUPPLYSTATUS_COREBUCKON_Enum;

/* =========================================  MCUCTRL SUPPLYSTATUS MEMBUCKON [0..0]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SUPPLYSTATUS_MEMBUCKON                                            */
  MCUCTRL_SUPPLYSTATUS_MEMBUCKON_LDO   = 0,     /*!< LDO : Indicates the LDO is supplying the memory power domain.             */
  MCUCTRL_SUPPLYSTATUS_MEMBUCKON_BUCK  = 1,     /*!< BUCK : Indicates the Buck is supplying the memory power domain.           */
} MCUCTRL_SUPPLYSTATUS_MEMBUCKON_Enum;

/* =======================================================  BANDGAPEN  ======================================================= */
/* ============================================  MCUCTRL BANDGAPEN BGPEN [0..0]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_BANDGAPEN_BGPEN                                                   */
  MCUCTRL_BANDGAPEN_BGPEN_DIS          = 0,     /*!< DIS : Bandgap disable.                                                    */
  MCUCTRL_BANDGAPEN_BGPEN_EN           = 1,     /*!< EN : Bandgap enable.                                                      */
} MCUCTRL_BANDGAPEN_BGPEN_Enum;

