TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* ====================================================  SRAMPWDINSLEEP  ===================================================== */
/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK7 [7..7]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK7                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK7_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 7 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK7_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 7 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK7_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK6 [6..6]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK6                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK6_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 6 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK6_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 6 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK6_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK5 [5..5]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK5                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK5_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 5 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK5_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 5 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK5_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK4 [4..4]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK4                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK4_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 4 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK4_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 4 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK4_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK3 [3..3]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK3                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK3_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 3 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK3_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 3 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK3_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK2 [2..2]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK2                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK2_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 2 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK2_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 2 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK2_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK1 [1..1]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK1                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK1_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 1 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK1_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 1 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK1_Enum;

/* ==========================================  MCUCTRL SRAMPWDINSLEEP BANK0 [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SRAMPWDINSLEEP_BANK0                                              */
  MCUCTRL_SRAMPWDINSLEEP_BANK0_NORMAL  = 0,     /*!< NORMAL : SRAM Bank 0 normal operation.                                    */
  MCUCTRL_SRAMPWDINSLEEP_BANK0_PWRDN_IN_DEEPSLEEP = 1,/*!< PWRDN_IN_DEEPSLEEP : SRAM Bank 0 deep sleep.                        */
} MCUCTRL_SRAMPWDINSLEEP_BANK0_Enum;

/* ======================================================  SRAMPWRDIS  ======================================================= */
/* ============================================  MCUCTRL SRAMPWRDIS BANK7 [7..7]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SRAMPWRDIS_BANK7                                                  */
  MCUCTRL_SRAMPWRDIS_BANK7_DIS         = 1,     /*!< DIS : Disable SRAM Bank 7.                                                */
} MCUCTRL_SRAMPWRDIS_BANK7_Enum;

/* ============================================  MCUCTRL SRAMPWRDIS BANK6 [6..6]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SRAMPWRDIS_BANK6                                                  */
  MCUCTRL_SRAMPWRDIS_BANK6_DIS         = 1,     /*!< DIS : Disable SRAM Bank 6.                                                */
} MCUCTRL_SRAMPWRDIS_BANK6_Enum;

/* ============================================  MCUCTRL SRAMPWRDIS BANK5 [5..5]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SRAMPWRDIS_BANK5                                                  */
  MCUCTRL_SRAMPWRDIS_BANK5_DIS         = 1,     /*!< DIS : Disable SRAM Bank 5.                                                */
} MCUCTRL_SRAMPWRDIS_BANK5_Enum;

/* ============================================  MCUCTRL SRAMPWRDIS BANK4 [4..4]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SRAMPWRDIS_BANK4                                                  */
  MCUCTRL_SRAMPWRDIS_BANK4_DIS         = 1,     /*!< DIS : Disable SRAM Bank 4.                                                */
} MCUCTRL_SRAMPWRDIS_BANK4_Enum;

