TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* ================================================  RTC RTCCTL WRTC [0..0]  ================================================= */
typedef enum {                                  /*!< RTC_RTCCTL_WRTC                                                           */
  RTC_RTCCTL_WRTC_DIS                  = 0,     /*!< DIS : Counter writes are disabled                                         */
  RTC_RTCCTL_WRTC_EN                   = 1,     /*!< EN : Counter writes are enabled                                           */
} RTC_RTCCTL_WRTC_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  DR  =========================================================== */
/* ================================================  UART DR OEDATA [11..11]  ================================================ */
typedef enum {                                  /*!< UART_DR_OEDATA                                                            */
  UART_DR_OEDATA_NOERR                 = 0,     /*!< NOERR : No error on UART OEDATA, overrun error indicator.                 */
  UART_DR_OEDATA_ERR                   = 1,     /*!< ERR : Error on UART OEDATA, overrun error indicator.                      */
} UART_DR_OEDATA_Enum;

/* ================================================  UART DR BEDATA [10..10]  ================================================ */
typedef enum {                                  /*!< UART_DR_BEDATA                                                            */
  UART_DR_BEDATA_NOERR                 = 0,     /*!< NOERR : No error on UART BEDATA, break error indicator.                   */
  UART_DR_BEDATA_ERR                   = 1,     /*!< ERR : Error on UART BEDATA, break error indicator.                        */
} UART_DR_BEDATA_Enum;

/* =================================================  UART DR PEDATA [9..9]  ================================================= */
typedef enum {                                  /*!< UART_DR_PEDATA                                                            */
  UART_DR_PEDATA_NOERR                 = 0,     /*!< NOERR : No error on UART PEDATA, parity error indicator.                  */
  UART_DR_PEDATA_ERR                   = 1,     /*!< ERR : Error on UART PEDATA, parity error indicator.                       */
} UART_DR_PEDATA_Enum;

/* =================================================  UART DR FEDATA [8..8]  ================================================= */
typedef enum {                                  /*!< UART_DR_FEDATA                                                            */
  UART_DR_FEDATA_NOERR                 = 0,     /*!< NOERR : No error on UART FEDATA, framing error indicator.                 */
  UART_DR_FEDATA_ERR                   = 1,     /*!< ERR : Error on UART FEDATA, framing error indicator.                      */
} UART_DR_FEDATA_Enum;

/* ==========================================================  RSR  ========================================================== */
/* ================================================  UART RSR OESTAT [3..3]  ================================================= */
typedef enum {                                  /*!< UART_RSR_OESTAT                                                           */
  UART_RSR_OESTAT_NOERR                = 0,     /*!< NOERR : No error on UART OESTAT, overrun error indicator.                 */
  UART_RSR_OESTAT_ERR                  = 1,     /*!< ERR : Error on UART OESTAT, overrun error indicator.                      */
} UART_RSR_OESTAT_Enum;

/* ================================================  UART RSR BESTAT [2..2]  ================================================= */
typedef enum {                                  /*!< UART_RSR_BESTAT                                                           */
  UART_RSR_BESTAT_NOERR                = 0,     /*!< NOERR : No error on UART BESTAT, break error indicator.                   */
  UART_RSR_BESTAT_ERR                  = 1,     /*!< ERR : Error on UART BESTAT, break error indicator.                        */
} UART_RSR_BESTAT_Enum;

/* ================================================  UART RSR PESTAT [1..1]  ================================================= */
typedef enum {                                  /*!< UART_RSR_PESTAT                                                           */
  UART_RSR_PESTAT_NOERR                = 0,     /*!< NOERR : No error on UART PESTAT, parity error indicator.                  */
  UART_RSR_PESTAT_ERR                  = 1,     /*!< ERR : Error on UART PESTAT, parity error indicator.                       */
} UART_RSR_PESTAT_Enum;

/* ================================================  UART RSR FESTAT [0..0]  ================================================= */
typedef enum {                                  /*!< UART_RSR_FESTAT                                                           */
  UART_RSR_FESTAT_NOERR                = 0,     /*!< NOERR : No error on UART FESTAT, framing error indicator.                 */
  UART_RSR_FESTAT_ERR                  = 1,     /*!< ERR : Error on UART FESTAT, framing error indicator.                      */
} UART_RSR_FESTAT_Enum;

/* ==========================================================  FR  =========================================================== */
/* ==================================================  UART FR TXFE [7..7]  ================================================== */
typedef enum {                                  /*!< UART_FR_TXFE                                                              */
  UART_FR_TXFE_XMTFIFO_EMPTY           = 1,     /*!< XMTFIFO_EMPTY : Transmit fifo is empty.                                   */
} UART_FR_TXFE_Enum;

/* ==================================================  UART FR RXFF [6..6]  ================================================== */
typedef enum {                                  /*!< UART_FR_RXFF                                                              */
  UART_FR_RXFF_RCVFIFO_FULL            = 1,     /*!< RCVFIFO_FULL : Receive fifo is full.                                      */
} UART_FR_RXFF_Enum;

/* ==================================================  UART FR TXFF [5..5]  ================================================== */
typedef enum {                                  /*!< UART_FR_TXFF                                                              */
  UART_FR_TXFF_XMTFIFO_FULL            = 1,     /*!< XMTFIFO_FULL : Transmit fifo is full.                                     */
} UART_FR_TXFF_Enum;

/* ==================================================  UART FR RXFE [4..4]  ================================================== */
typedef enum {                                  /*!< UART_FR_RXFE                                                              */
  UART_FR_RXFE_RCVFIFO_EMPTY           = 1,     /*!< RCVFIFO_EMPTY : Receive fifo is empty.                                    */
} UART_FR_RXFE_Enum;

