TUDSSL/ENGAGE/software/external/CMSIS/AmbiqMicro/Include/apollo1.h
/* ==================================================  UART FR BUSY [3..3]  ================================================== */
typedef enum {                                  /*!< UART_FR_BUSY                                                              */
  UART_FR_BUSY_BUSY                    = 1,     /*!< BUSY : UART busy indicator.                                               */
} UART_FR_BUSY_Enum;

/* ==================================================  UART FR DCD [2..2]  =================================================== */
typedef enum {                                  /*!< UART_FR_DCD                                                               */
  UART_FR_DCD_DETECTED                 = 1,     /*!< DETECTED : Data carrier detect detected.                                  */
} UART_FR_DCD_Enum;

/* ==================================================  UART FR DSR [1..1]  =================================================== */
typedef enum {                                  /*!< UART_FR_DSR                                                               */
  UART_FR_DSR_READY                    = 1,     /*!< READY : Data set ready.                                                   */
} UART_FR_DSR_Enum;

/* ==================================================  UART FR CTS [0..0]  =================================================== */
typedef enum {                                  /*!< UART_FR_CTS                                                               */
  UART_FR_CTS_CLEARTOSEND              = 1,     /*!< CLEARTOSEND : Clear to send is indicated.                                 */
} UART_FR_CTS_Enum;

/* =========================================================  ILPR  ========================================================== */
/* =========================================================  IBRD  ========================================================== */
/* =========================================================  FBRD  ========================================================== */
/* =========================================================  LCRH  ========================================================== */
/* ==========================================================  CR  =========================================================== */
/* =================================================  UART CR CLKSEL [4..6]  ================================================= */
typedef enum {                                  /*!< UART_CR_CLKSEL                                                            */
  UART_CR_CLKSEL_NOCLK                 = 0,     /*!< NOCLK : No UART clock. This is the low power default.                     */
  UART_CR_CLKSEL_24MHZ                 = 1,     /*!< 24MHZ : 24 MHz clock. Must be used if CLKGEN CORESEL=0.                   */
  UART_CR_CLKSEL_12MHZ                 = 2,     /*!< 12MHZ : 12 MHz clock. Must be used if CLKGEN CORESEL=1. Note
                                                     that CORESEL=1 is unsupported by the IO Master.                           */
  UART_CR_CLKSEL_6MHZ                  = 3,     /*!< 6MHZ : 6 MHz clock. Must be used if CLKGEN CORESEL=2, 3, or
                                                     4. Note that CORESEL=2 is unsupported.                                    */
  UART_CR_CLKSEL_3MHZ                  = 4,     /*!< 3MHZ : 3 MHz clock. Must be used if CLKGEN CORESEL=5, 6, or
                                                     7.                                                                        */
} UART_CR_CLKSEL_Enum;

/* =========================================================  IFLS  ========================================================== */
/* ==========================================================  IER  ========================================================== */
/* ==========================================================  IES  ========================================================== */
/* ==========================================================  MIS  ========================================================== */
/* ==========================================================  IEC  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ===============================================  VCOMP CFG LVLSEL [16..19]  =============================================== */
typedef enum {                                  /*!< VCOMP_CFG_LVLSEL                                                          */
  VCOMP_CFG_LVLSEL_0P58V               = 0,     /*!< 0P58V : Set Reference input to 0.58 Volts.                                */
  VCOMP_CFG_LVLSEL_0P77V               = 1,     /*!< 0P77V : Set Reference input to 0.77 Volts.                                */
  VCOMP_CFG_LVLSEL_0P97V               = 2,     /*!< 0P97V : Set Reference input to 0.97 Volts.                                */
  VCOMP_CFG_LVLSEL_1P16V               = 3,     /*!< 1P16V : Set Reference input to 1.16 Volts.                                */
  VCOMP_CFG_LVLSEL_1P35V               = 4,     /*!< 1P35V : Set Reference input to 1.35 Volts.                                */
  VCOMP_CFG_LVLSEL_1P55V               = 5,     /*!< 1P55V : Set Reference input to 1.55 Volts.                                */
  VCOMP_CFG_LVLSEL_1P74V               = 6,     /*!< 1P74V : Set Reference input to 1.74 Volts.                                */
  VCOMP_CFG_LVLSEL_1P93V               = 7,     /*!< 1P93V : Set Reference input to 1.93 Volts.                                */
  VCOMP_CFG_LVLSEL_2P13V               = 8,     /*!< 2P13V : Set Reference input to 2.13 Volts.                                */
  VCOMP_CFG_LVLSEL_2P32V               = 9,     /*!< 2P32V : Set Reference input to 2.32 Volts.                                */
  VCOMP_CFG_LVLSEL_2P51V               = 10,    /*!< 2P51V : Set Reference input to 2.51 Volts.                                */
  VCOMP_CFG_LVLSEL_2P71V               = 11,    /*!< 2P71V : Set Reference input to 2.71 Volts.                                */
  VCOMP_CFG_LVLSEL_2P90V               = 12,    /*!< 2P90V : Set Reference input to 2.90 Volts.                                */
  VCOMP_CFG_LVLSEL_3P09V               = 13,    /*!< 3P09V : Set Reference input to 3.09 Volts.                                */
  VCOMP_CFG_LVLSEL_3P29V               = 14,    /*!< 3P29V : Set Reference input to 3.29 Volts.                                */
  VCOMP_CFG_LVLSEL_3P48V               = 15,    /*!< 3P48V : Set Reference input to 3.48 Volts.                                */
} VCOMP_CFG_LVLSEL_Enum;

/* =================================================  VCOMP CFG NSEL [8..9]  ================================================= */
typedef enum {                                  /*!< VCOMP_CFG_NSEL                                                            */
  VCOMP_CFG_NSEL_VREFEXT1              = 0,     /*!< VREFEXT1 : Use external reference 1 for reference input.                  */
  VCOMP_CFG_NSEL_VREFEXT2              = 1,     /*!< VREFEXT2 : Use external reference 2 for reference input.                  */
  VCOMP_CFG_NSEL_VREFEXT3              = 3,     /*!< VREFEXT3 : Use external reference 3 for reference input.                  */
} VCOMP_CFG_NSEL_Enum;

/* =================================================  VCOMP CFG PSEL [0..1]  ================================================= */
typedef enum {                                  /*!< VCOMP_CFG_PSEL                                                            */
  VCOMP_CFG_PSEL_VDDADJ                = 0,     /*!< VDDADJ : Use VDDADJ for the positive input.                               */
  VCOMP_CFG_PSEL_VTEMP                 = 1,     /*!< VTEMP : Use the temperature sensor output for the positive input.         */
  VCOMP_CFG_PSEL_VEXT1                 = 2,     /*!< VEXT1 : Use external voltage 1 for positive input.                        */
  VCOMP_CFG_PSEL_VEXT2                 = 3,     /*!< VEXT2 : Use external voltage 1 for positive input.                        */
} VCOMP_CFG_PSEL_Enum;

/* =========================================================  STAT  ========================================================== */
/* ===============================================  VCOMP STAT PWDSTAT [1..1]  =============================================== */
typedef enum {                                  /*!< VCOMP_STAT_PWDSTAT                                                        */
  VCOMP_STAT_PWDSTAT_POWERED_DOWN      = 1,     /*!< POWERED_DOWN : The voltage comparator is powered down.                    */
} VCOMP_STAT_PWDSTAT_Enum;

